Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fr

source: Get started
fr: Démarrer avec Sphinx

source: User Guides
fr: Guides Utilisateurs

source: Community
fr: Communauté

source: Reference
fr: Références

source: Welcome
fr: Bienvenue

source: Sphinx makes it easy to create intelligent and beautiful documentation.
fr: Sphinx facilite la création de documentations belles et intelligentes.

source: Here are some of Sphinx's major features:
fr: Voici quelques-unes des fonctionnalités majeures de Sphinx :

source: **Output formats:** HTML (including Windows HTML Help), LaTeX (for printable PDF versions), ePub, Texinfo, manual pages, plain text
fr: **Formats de sortie :** HTML (y compris Aide HTML Windows), LaTeX (pour les versions imprimables PDF), ePub, Texinfo, pages de manuel, texte brut.

source: **Extensive cross-references:** semantic markup and automatic links for functions, classes, citations, glossary terms and similar pieces of information
fr: **Références croisées étendues :** balisage sémantique et liens automatiques pour les fonctions, classes, citations, termes de glossaire et éléments d'information similaires.

source: **Hierarchical structure:** easy definition of a document tree, with automatic links to siblings, parents and children
fr: **Structure hiérarchique :** définition aisée d'une arborescence de document, avec liens automatiques vers les nœuds frères, parents et enfants.

source: **Automatic indices:** general index as well as a language-specific module indices
fr: **Index automatiques :** index général ainsi que les index de modules spécifiques aux langages.

source: **Code handling:** automatic highlighting using the Pygments_ highlighter
fr: **Gestion du code :** coloration syntaxique automatique en utilisant l'outil Pygments_.

source: **Extensions:** automatic testing of code snippets, inclusion of docstrings from Python modules (API docs) via :ref:`built-in extensions <builtin-extensions>`, and much more functionality via :ref:`third-party extensions <third-party-extensions>`.
fr: **Extensions :** test automatique des extraits de code, inclusion des docstrings depuis les modules Python (documentations d'API) grâce aux :ref:`extensions intégrées <builtin-extensions>`, et bien plus encore grâce aux :ref:`extensions tierces<third-party-extensions>`.

source: **Themes:** modify the look and feel of outputs via :doc:`creating themes <development/theming>`, and re-use many :ref:`third-party themes <third-party-themes>`.
fr: **Thèmes :** personnalisation de l'aspect et de l'ergonomie des sorties par la :doc:`création de thèmes <development/theming>`, et la réutilisation de nombreux :ref:`thèmes tiers <third-party-themes>`.

source: **Contributed extensions:** dozens of extensions :ref:`contributed by users <third-party-extensions>`; most of them installable from PyPI.
fr: **Contribution d'extensions :** des douzaines d'extensions :ref:`développées par les utilisateurs <third-party-extensions>`; la plupart installable depuis PyPI.

source: Sphinx uses the reStructuredText_ markup language by default, and can read :ref:`MyST markdown <markdown>` via third-party extensions. Both of these are powerful and straightforward to use, and have functionality for complex documentation and publishing workflows. They both build upon Docutils_ to parse and write documents.
fr: Sphinx utilise le langage de balisage reStructuredText_ par défaut, et peut lire le :ref:`MyST markdown <markdown>` grâce à des extensions tierces. Les deux sont à la fois puissants, simples à utiliser, et offrent des fonctionnalités pour les documentations et flux de publication complexes. Tous deux s'appuient sur Docutils_ pour lire et écrire les documents.

source: See below for how to navigate Sphinx's documentation.
fr: Voir ci-dessous comment naviguer dans la documentation de Sphinx.

source: The `Sphinx documentation Table of Contents <contents.html>`_ has a full list of this site's pages.
fr: La `Table des Matières de la documentation de Sphinx <contents.html>`_ présente une liste complète des pages de ce site.

source: These sections cover the basics of getting started with Sphinx, including creating and building your own documentation from scratch.
fr: Ces sections couvrent les bases du démarrage avec Sphinx, incluant la création et la construction de votre propre documentation à partir de zéro.

source: These sections cover various topics in using and extending Sphinx for various use-cases. They are a comprehensive guide to using Sphinx in many contexts and assume more knowledge of Sphinx. If you are new to Sphinx, we recommend starting with :ref:`get-started`.
fr: Ces sections couvrent divers sujets concernant l'utilisation et l'extension de Sphinx dans différents cas d'utilisation. Elles sont un guide complet à l'utilisation de Sphinx dans de nombreux contextes et supposent une plus grande connaissance de Sphinx. Si vous débutez avec Sphinx, nous vous recommandons de commencer par :ref:`get-started`.

source: Community guide
fr: Guide de la communauté

source: Sphinx is community supported and welcomes contributions from anybody. The sections below should help you get started joining the Sphinx community as well as contributing.
fr: Sphinx est supporté par sa communauté et accueille les contributions de quiconque. Les sections ci-dessous devraient vous accompagner pour rejoindre la communauté Sphinx ainsi que pour contribuer.

source: See the :doc:`Sphinx contributors' guide <internals/contributing>` if you would like to contribute to the project.
fr: Référez-vous au :doc:`Guide du contributeur Sphinx <internals/contributing>` si vous souhaitez contribuer au projet.

source: Reference guide
fr: Guide de référence

source: Reference documentation is more complete and programmatic in nature, it is a collection of information that can be quickly referenced. If you would like usecase-driven documentation, see :ref:`get-started` or :ref:`user-guides`.
fr: La documentation de référence est plus complète et programmatique par nature, c'est une collection d'informations pouvant être rapidement référencées. Si vous souhaitez une documentation orientée cas d'utilisation, référez-vous au :ref:`get-started` ou au :ref:`user-guides`.
