Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/install.po
Languages: fr

source: Installing Sphinx
fr: Installer Sphinx

source: Since Sphinx is written in the Python language, you need to install Python (the required version is at least 2.7) and Sphinx.
fr: Puisque Sphinx est écrit en langage Python, vous devez installer Python (la version requise est au moins 2.7) et Sphinx.

source: Sphinx packages are available on the `Python Package Index <https://pypi.python.org/pypi/Sphinx>`_.
fr: Les packages Sphinx sont disponibles sur `Python Package Index <https://pypi.python.org/pypi/Sphinx>`_.

source: You can also download a snapshot from the Git repository:
fr: Vous pouvez également télécharger un instantané à partir du dépôt Git :

source: as a `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ file or
fr: en tant que fichier `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ ou

source: as a `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_ file
fr: sous forme de fichier `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_

source: There are introductions for several environments:
fr: Il existe des introductions pour plusieurs environnements :

source: Debian/Ubuntu: Install Sphinx using packaging system
fr: Debian/Ubuntu: Installez Sphinx en utilisant le gestionnaire de paquets

source: You may install using this command if you use Debian/Ubuntu.
fr: Vous pouvez effectuer l'installation en utilisant cette commande si vous utilisez Debian/Ubuntu.

source: Other Linux distributions
fr: Pour les autres distribution sLinux

source: Most Linux distributions have Sphinx in their package repositories. Usually the package is called "python-sphinx", "python-Sphinx" or "sphinx". Be aware that there are two other packages with "sphinx" in their name: a speech recognition toolkit (CMU Sphinx) and a full-text search database (Sphinx search).
fr: La plupart des distributions Linux ont Sphinx dans leurs référentiels de packages. Habituellement, le package est appelé "python-sphinx", "python-Sphinx" ou "sphinx". Sachez qu'il existe deux autres packages avec « sphinx » dans leur nom : une boîte à outils de reconnaissance vocale (CMU Sphinx) et une base de données de recherche en texte intégral (recherche Sphinx).

source: Mac OS X: Install Sphinx using MacPorts
fr: Mac OS X: Installez Sphinx en utilisant MacPorts

source: If you use Mac OS X `MacPorts <http://www.macports.org/>`_, use this command to install all necessary software.
fr: Si vous utilisez Mac OS X `MacPorts <http://www.macports.org/>`_, utilisez cette commande pour installer tous les logiciels nécessaires.

source: To set up the executable paths, use the ``port select`` command:
fr: Pour configurer les chemins des exécutables, utilisez la commande "port select" :

source: Type :command:`which sphinx-quickstart` to check if the installation was successful.
fr: Tapez :command:`which sphinx-quickstart` pour vérifier si l'installation a réussi.

source: Windows: Install Python and Sphinx
fr: Windows : Installer Python et Sphinx

source: Install Python
fr: Installez Python

source: Most Windows users do not have Python, so we begin with the installation of Python itself. If you have already installed Python, please skip this section.
fr: La plupart des utilisateurs de Windows ne disposent pas de Python, nous commençons donc par l'installation de Python lui-même. Si vous avez déjà installé Python, veuillez ignorer cette section.

source: Go to https://www.python.org/, the main download site for Python. Look at the left sidebar and under "Quick Links", click "Windows Installer" to download.
fr: Accédez à https://www.python.org/, le principal site de téléchargement de Python. Regardez la barre latérale gauche et sous « Liens rapides », cliquez sur « Windows Installer » pour télécharger.

source: Currently, Python offers two major versions, 2.x and 3.x. Sphinx 1.5 can run under Python 2.7, 3.4, 3.5, 3.6, with the recommended version being 2.7. This chapter assumes you have installed Python 2.7.
fr: Actuellement, Python propose deux versions majeures, 2.x et 3.x. Sphinx 1.5 peut fonctionner sous Python 2.7, 3.4, 3.5, 3.6, la version recommandée étant la 2.7. Ce chapitre suppose que vous avez installé Python 2.7.

source: Follow the Windows installer for Python.
fr: Suivre l'installeur Windows pour Python

source: After installation, you better add the Python executable directories to the environment variable ``PATH`` in order to run Python and package commands such as ``sphinx-build`` easily from the Command Prompt.
fr: Après l'installation, il est préférable d'ajouter les répertoires des exécutables Python à la variable d'environnement "PATH" afin d'exécuter facilement des commandes Python et des paquets tels que "sphinx-build" à partir de l'invite de commande.

source: Right-click the "My Computer" icon and choose "Properties"
fr: Cliquer droit sur l'icône "Mon ordinateur" et sélectionnez "Propriétés"

source: Click the "Environment Variables" button under the "Advanced" tab
fr: Cliquez sur le bouton "Variables d'environnement" sous l'onglet "Avancé".

source: If "Path" (or "PATH") is already an entry in the "System variables" list, edit it. If it is not present, add a new variable called "PATH".
fr: Si "Path" (ou "PATH") est déjà une entrée dans la liste "Variables système", modifiez-la. Si elle n'est pas présente, ajoutez une nouvelle variable appelée "PATH".

source: Add these paths, separating entries by ";":
fr: Ajoutez ces chemins, en séparant les entrées par ";" :

source: ``C:\Python27`` -- this folder contains the main Python executable
fr: ``C:\Python27`` -- ce dossier contient l'exécutable Python principal

source: ``C:\Python27\Scripts`` -- this folder will contain executables added by Python packages installed with pip (see below)
fr: ``C:\Python27\Scripts`` -- ce dossier contiendra les exécutables ajoutés par les packages Python installés avec pip (voir ci-dessous)

source: This is for Python 2.7. If you use another version of Python or installed to a non-default location, change the digits "27" accordingly.
fr: C'est pour Python 2.7. Si vous utilisez une autre version de Python ou si vous l'installez à un emplacement autre que celui par défaut, modifiez les chiffres "27" en conséquence.

source: Now run the **Command Prompt**. After command prompt window appear, type ``python`` and Enter. If the Python installation was successful, the installed Python version is printed, and you are greeted by the prompt ``>>>``. Type ``Ctrl+Z`` and Enter to quit.
fr: Exécutez maintenant l'**Invite de commandes**. Après l'apparition de la fenêtre d'invite de commande, tapez ``python`` et Entrée. Si l'installation de Python a réussi, la version Python installée est imprimée et vous êtes accueilli par l'invite ``>>>``. Tapez ``Ctrl+Z`` et Entrée pour quitter.

source: Install the pip command
fr: Installez la commande pip

source: Python has a very useful :command:`pip` command which can download and install 3rd-party libraries with a single command. This is provided by the Python Packaging Authority(PyPA): https://groups.google.com/forum/#!forum/pypa-dev
fr: Python a une commande :command:`pip` très utile qui peut télécharger et installer des bibliothèques tierces avec une seule commande. Ceci est fourni par la Python Packaging Authority (PyPA) : https://groups.google.com/forum/#!forum/pypa-dev

source: To install pip, download https://bootstrap.pypa.io/get-pip.py and save it somewhere. After download, invoke the command prompt, go to the directory with ``get-pip.py`` and run this command:
fr: Pour installer pip, téléchargez https://bootstrap.pypa.io/get-pip.py et enregistrez-le quelque part. Après le téléchargement, appelez l'invite de commande, allez dans le répertoire avec ``get-pip.py`` et exécutez cette commande :

source: Now :command:`pip` command is installed. From there we can go to the Sphinx install.
fr: SphinxMaintenant, la commande :command:`pip` est installée. De là, nous pouvons procéder à l’installation de Sphinx.

source: ``pip`` has been contained in the Python official installation after version of Python-3.4.0 or Python-2.7.9.
fr: ``pip`` a été contenu dans l'installation officielle de Python après la version de Python-3.4.0 ou Python-2.7.9.

source: Installing Sphinx with pip
fr: Installer Sphinx avec pip

source: If you finished the installation of pip, type this line in the command prompt:
fr: Si vous avez terminé l'installation de pip, tapez cette ligne dans l'invite de commande :

source: After installation, type :command:`sphinx-build -h` on the command prompt. If everything worked fine, you will get a Sphinx version number and a list of options for this command.
fr: Après l'installation, tapez :command:`sphinx-build -h` sur l'invite de commande. Si tout a bien fonctionné, vous obtiendrez un numéro de version Sphinx et une liste d'options pour cette commande.

source: That it. Installation is over. Head to :doc:`tutorial` to make a Sphinx project.
fr: C'est ça. L'installation est terminée. Rendez-vous sur :doc:`tutorial` pour créer un projet Sphinx.
