Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/autodoc.po
Languages: pt_br, zh_cn

source: Emitted before autodoc formats a signature for an object. The event handler can modify an object to change its signature.
pt_br: Emitido antes do autodoc formatar uma assinatura para um objeto. O manipulador de eventos pode modificar um objeto para alterar sua assinatura.
zh_cn: 在autodoc格式化对象的签名之前发出。事件处理程序可以修改对象以更改其签名。

source: a boolean indicates an object is bound method or not
pt_br: um booleano indica que um objeto é um método vinculado ou não
zh_cn: 布尔值表示对象是否是绑定方法

source: Emitted when autodoc has formatted a signature for an object. The event handler can return a new tuple ``(signature, return_annotation)`` to change what Sphinx puts into the output.
pt_br: Emitido quando o autodoc formatou uma assinatura para um objeto. O manipulador de eventos pode retornar uma nova tupla ``(signature, return_annotation)`` para alterar o que o Sphinx coloca na saída.
zh_cn: 当自动文档已格式化对象的签名时发出。事件处理程序可以返回一个新的元组`（签名，返回标记）``来更改Sphinx在输出中的内容。

source: function signature, as a string of the form ``"(parameter_1, parameter_2)"``, or ``None`` if introspection didn't succeed and signature wasn't specified in the directive.
pt_br: assinatura de função, como uma string no formato ``"(parameter_1, parameter_2)"`` ou ``None`` se a introspecção não tiver sido bem-sucedida e a assinatura não tiver sido especificada na diretiva.
zh_cn: 函数签名，如果自省未成功，并且指令中未指定签名，则为格式为“`”（参数_1，参数_2）”``或“无”形式的字符串。

source: function return annotation as a string of the form ``" -> annotation"``, or ``None`` if there is no return annotation
pt_br: anotação do retorno da função como uma string no formato ``" -> annotation"``, ou ``None`` se não houver anotação de retorno
zh_cn: 函数return annotation，格式为“—>annotation”`，如果没有return annotation，则返回“None”

source: The :mod:`sphinx.ext.autodoc` module provides factory functions for commonly needed docstring processing in event :event:`autodoc-process-docstring`:
pt_br: O módulo :mod:`sphinx.ext.autodoc` fornece funções de fábrica para o processamento ``docstring`` comumente necessário no evento :event:`autodoc-process-docstring`:
zh_cn: ：mod:`sphinx.ext.autodoc`模块提供工厂函数，用于在事件：事件:`自动文档处理文档字符串`:

source: Return a listener that removes the first *pre* and last *post* lines of every docstring. If *what* is a sequence of strings, only docstrings of a type in *what* will be processed.
pt_br: Retorna um "listener" que remove o primeiro *pre* e as últimas linhas *post* de cada docstring. Se *what* for uma sequência de strings, somente as docstrings de um tipo em *what* serão processadas.
zh_cn: 返回一个侦听器，它删除每个文档字符串的第一行*pre*行和最后一行*post*。如果*what*是字符串序列，则只处理*what*中类型的文档字符串。

source: Use like this (e.g. in the ``setup()`` function of :file:`conf.py`)::
pt_br: Use assim (por exemplo, na função ``setup()`` do :file:`conf.py`)::
zh_cn: 像这样使用（例如在file:file的``setup（）``函数中：`配置文件`)::

source: This can (and should) be used in place of :confval:`automodule_skip_lines`.
pt_br: Isso pode (e deve) ser usado no lugar de :confval:`automodule_skip_lines`.
zh_cn: 这可以（也应该）代替：confval:`automodule_skip_lines`。

source: Return a listener that either keeps, or if *exclude* is True excludes, lines between lines that match the *marker* regular expression. If no line matches, the resulting docstring would be empty, so no change will be made unless *keepempty* is true.
pt_br: Retorna um "listener" que mantém, ou se *exclude* for True, linhas entre as linhas que correspondem à expressão regular *marker*. Se nenhuma linha corresponder, a docstring resultante estará vazia, portanto nenhuma alteração será feita a menos que *keepempty* seja True.
zh_cn: 返回一个侦听器，该侦听器保留或如果*exclude*为真，则排除与*marker*正则表达式匹配的行之间的行。如果没有行匹配，则生成的文档字符串将为空，因此除非*keepmpty*为真，否则不会进行任何更改。

source: If *what* is a sequence of strings, only docstrings of a type in *what* will be processed.
pt_br: Se *what* for uma sequência de strings, somente as docstrings de um tipo em *what* serão processadas.
zh_cn: 如果*what*是字符串序列，则只处理*what*中类型的文档字符串。

source: Emitted when autodoc has read and processed a class to determine the base-classes. *bases* is a list of classes that the event handler can modify **in place** to change what Sphinx puts into the output. It's emitted only if ``show-inheritance`` option given.
pt_br: Emitido quando autodoc leu e processou uma classe para determinar as classes básicas. *bases* é uma lista de classes que o manipulador de eventos pode modificar **no local** para alterar o que o Sphinx coloca na saída. É emitido apenas se a opção ``show-inheritance`` for fornecida.

source: the options given to the class directive
pt_br: as opções fornecidas para a diretiva da classe

source: the list of base classes signature. see above.
pt_br: a lista de assinatura de classes base, veja acima.

source: ``bases`` can contain a string as a base class name. It will be processed as reST mark-up'ed text.
pt_br: ``bases`` pode conter uma string como nome de classe base. Ele será processado como texto com marcação reST.

source: Skipping members
pt_br: Ignorando membros
zh_cn: 跳过成员

source: autodoc allows the user to define a custom method for determining whether a member should be included in the documentation by using the following event:
pt_br: O autodoc permite que o usuário defina um método personalizado para determinar se um membro deve ser incluído na documentação usando o seguinte evento:
zh_cn: 自动文档允许用户定义一个自定义方法，通过使用以下事件确定是否应将成员包括在文档中：

source: Emitted when autodoc has to decide whether a member should be included in the documentation. The member is excluded if a handler returns ``True``. It is included if the handler returns ``False``.
pt_br: Emitido quando o autodoc tem que decidir se um membro deve ser incluído na documentação. O membro é excluído se um manipulador retornar ``True``. Está incluído se o manipulador retornar ``False``.
zh_cn: 当自动文档必须决定是否应将成员包含在文档中时发出。如果处理程序返回“True”，则排除该成员。如果处理程序返回“False”，则会包含此函数。

source: If more than one enabled extension handles the ``autodoc-skip-member`` event, autodoc will use the first non-``None`` value returned by a handler. Handlers should return ``None`` to fall back to the skipping behavior of autodoc and other enabled extensions.
pt_br: Se mais de uma extensão ativada manipular o evento ``autodoc-skip-member``, o autodoc usará o primeiro valor não ``None`` retornado por um manipulador. Os manipuladores devem retornar ``None`` para retornar ao comportamento de salto do autodoc e de outras extensões ativadas.
zh_cn: 如果多个已启用的扩展处理“自动文档跳过成员r”事件，自动文档将使用处理程序返回的第一个非“None”值。处理程序应返回“None”以返回自动文档和其他已启用扩展的跳过行为。

source: a boolean indicating if autodoc will skip this member if the user handler does not override the decision
pt_br: um booleano indicando se o autodoc pulará este membro se o manipulador de usuário não substituir a decisão
zh_cn: 一个布尔值，指示如果用户处理程序不重写决策，自动文档是否将跳过此成员

source: For Sphinx (actually, the Python interpreter that executes Sphinx) to find your module, it must be importable. That means that the module or the package must be in one of the directories on :data:`sys.path` -- adapt your :data:`sys.path` in the configuration file accordingly.
zh_cn: 为了让Sphinx（实际上是执行Sphinx的Python解释器）找到您的模块，它必须是可导入的。这意味着模块或包必须位于以下目录之一：data:`搜索路径`--调整您的：数据：`搜索路径`在相应的配置文件中。

source: ``"class"``
zh_cn: ``"类"``

source: ``"both"``
zh_cn: ``"都"``

source: ``"init"``
zh_cn: ``"初始化"``
