Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/autodoc.po
Languages: pt_br, zh_cn

source: :mod:`sphinx.ext.autodoc` -- Include documentation from docstrings
pt_br: :mod:`sphinx.ext.autodoc` - Inclui documentação das docstrings
zh_cn: ：模式：`sphinx.ext.autodoc`--包括来自docstrings的文档

source: This extension can import the modules you are documenting, and pull in documentation from docstrings in a semi-automatic way.
pt_br: Essa extensão pode importar módulos que estão sendo documentados, e carregar na documentação a partir de docstrings de forma semiautomática.
zh_cn: 这个插件可以导入正在编写文档的模块，并以半自动的方式从文档字符串中拉入文档。

source: :mod:`~sphinx.ext.autodoc` **imports** the modules to be documented. If any modules have side effects on import, these will be executed by ``autodoc`` when ``sphinx-build`` is run.
pt_br: :mod:`~sphinx.ext.autodoc` **importa** os módulos a serem documentados. Se algum módulo tiver efeitos na importação, serão executados por ``autodoc`` quando ``sphinx-build`` for executado.
zh_cn: :mod:`~sphinx.ext.autodoc` 会 **import** 所有需要自动生成文档的模块。如果某些模块在导入时有一些额外的操作，在运行 ``sphinx-build`` 时，也会被 ``autodoc`` 执行。

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
pt_br: Se os scripts do seu documento, (diferentemente de módulos de biblioteca), certificar-se que suas rotinas principais estejam protegidas por uma condição ``if __name__ == '__main__'``.
zh_cn: 如果你要引入脚本（而不是库模块），确保主程序 main 有这个条件保护着：``if __name__ == '__main__'``。

source: For this to work, the docstrings must of course be written in correct reStructuredText. You can then use all of the usual Sphinx markup in the docstrings, and it will end up correctly in the documentation. Together with hand-written documentation, this technique eases the pain of having to maintain two locations for documentation, while at the same time avoiding auto-generated-looking pure API documentation.
pt_br: Para que isso funcione, as docstrings devem, é claro, ser escritas em reStructuredText correto. Você pode então usar toda a marcação usual do Sphinx nas docstrings e ela acabará corretamente na documentação. Juntamente com a documentação escrita à mão, essa técnica facilita a manutenção de dois locais para a documentação, evitando, ao mesmo tempo, a documentação pura da API com aparência gerada automaticamente.
zh_cn: 为了实现这一点，文档字符串当然必须用正确的重构文本编写。然后您可以在文档字符串中使用所有通常的Sphinx标记，它将在文档中正确结束。与手工编写的文档一起，这种技术减轻了为文档维护两个位置的负担，同时避免了自动生成的纯API文档。

source: If you prefer `NumPy`_ or `Google`_ style docstrings over reStructuredText, you can also enable the :mod:`napoleon <sphinx.ext.napoleon>` extension. :mod:`napoleon <sphinx.ext.napoleon>` is a preprocessor that converts your docstrings to correct reStructuredText before :mod:`autodoc` processes them.
pt_br: Se você prefere o estilo das docstrings do `NumPy`_ ou do `Google`_ ao do reStructuredText, você também pode habilitar a extensão :mod:`napoleon <sphinx.ext.napoleon>`. :mod:`napoleon <sphinx.ext.napoleon>` é um pré-processador que converte suas docstrings para corrigir o reStructuredText antes que o :mod:`autodoc` os processe.
zh_cn: 如果您喜欢“NumPy”或“Google”样式的文档字符串而不是重构文本，还可以启用：mod:`napoleon <sphinx.ext.napoleon>`。：mod:`napoleon<sphinx.ext.napoleon>`是一个预处理器，它在mod:`autodoc`处理文档字符串之前将其转换为正确的重构文本。

source: Getting started
pt_br: Primeiros passos

source: Setup
pt_br: Configuração

source: Activate the plugin by adding ``'sphinx.ext.autodoc'`` to the :confval:`extensions` in your :file:`conf.py`::
pt_br: Ative o plugin adicionando ``'sphinx.ext.autodoc'`` ao :confval:`extensions` em seu :file:`conf.py`::

source: Ensuring the code can be imported
pt_br: Garantir que o código possa ser importado

source: :mod:`~sphinx.ext.autodoc` analyses the code and docstrings by introspection after importing the modules. For importing to work, you have to make sure that your modules can be found by Sphinx and that dependencies can be resolved (if your module does ``import foo``, but ``foo`` is not available in the python environment that Sphinx runs in, your module import will fail).
pt_br: :mod:`~sphinx.ext.autodoc` analisa o código e os docstrings por introspecção após importar os módulos. Para a importação funcionar, você tem que ter certeza de que seus módulos podem ser encontrados pelo Sphinx e que as dependências podem ser resolvidas (se o seu módulo faz ``import foo``, mas ``foo`` não está disponível no ambiente python em que o Sphinx é executado, sua importação do módulo falhará).

source: There are two ways to ensure this:
pt_br: Existem duas maneiras de garantir isso:

source: Use an environment that contains your package and Sphinx. This can e.g. be your local dev environment (with an editable install), or an environment in CI in which you install Sphinx and your package. The regular installation process ensures that your package can be found by Sphinx and that all dependencies are available.
pt_br: Use um ambiente que contenha seu pacote e o Sphinx. Isto pode, p. ex., ser seu ambiente de desenvolvimento local (com uma instalação editável) ou um ambiente de CI no qual você instala o Sphinx e seu pacote. O processo regular de instalação garante que seu pacote possa ser encontrado pelo Sphinx e que todas as dependências estejam disponíveis.

source: It is alternatively possible to patch the Sphinx run so that it can operate directly on the sources; e.g. if you want to be able to do a Sphinx build from a source checkout.
pt_br: Alternativamente, é possível corrigir a execução do Sphinx para que ele possa operar diretamente nas fontes; por exemplo, se você quiser fazer uma construção de Sphinx a partir de um checkout local de fontes.

source: Patch :data:`sys.path` in your Sphinx :file:`conf.py` to include the folder of your sources. E.g. if you have a repository structure with :file:`doc/conf.py` and your package is at :file:`src/mypackage`, then you should add::
pt_br: Edite :data:`sys.path` em seu Sphinx :file:`conf.py` para incluir a pasta de suas fontes. Por exemplo. se você tiver uma estrutura de repositório com :file:`doc/conf.py` e seu pacote estiver em :file:`src/mypackage`, então você deve adicionar::

source: to your :file:`conf.py`.
pt_br: a seu :file:`conf.py`.

source: To cope with missing dependencies, specify the missing modules in :confval:`autodoc_mock_imports`.
pt_br: Para lidar com dependências ausentes, especifique os módulos ausentes em :confval:`autodoc_mock_imports`.

source: Usage
pt_br: Uso

source: You can now use the :ref:`autodoc-directives` to add formatted documentation for Python code elements like functions, classes, modules, etc. For example, to document the function ``io.open()``, reading its signature and docstring from the source file, you'd write ::
pt_br: Agora você pode usar :ref:`autodoc-directives` para adicionar documentação formatada para elementos de código Python como funções, classes, módulos, etc. Por exemplo, para documentar a função ``io.open()``, lendo sua assinatura e docstring do arquivo fonte, você escreveria ::

source: You can also document whole classes or even modules automatically, using member options for the auto directives, like ::
pt_br: Também podem ser documentadas automaticamente, todas classes ou mesmo módulos, usando opções para diretivas automáticas como::

source: Directives
pt_br: Diretivas
zh_cn: 指令

source: :mod:`autodoc` provides several directives that are versions of the usual :rst:dir:`py:module`, :rst:dir:`py:class` and so forth. On parsing time, they import the corresponding module and extract the docstring of the given objects, inserting them into the page source under a suitable :rst:dir:`py:module`, :rst:dir:`py:class` etc. directive.
pt_br: :mod:`autodoc` fornece várias diretivas que são versões do usual :rst:dir:`py:module`, :rst:dir:`py:class` e assim por diante. No tempo de análise, eles importam o módulo correspondente e extraem a docstring dos objetos fornecidos, inserindo-os na fonte da página sob uma diretiva apropriada :rst:dir:`py:module`, :rst:dir:`py:class` etc.
zh_cn: ：mod:`autodoc`提供了几种常见指令的版本：rst:方向：`py:module`，：rst:方向：`py:class`等等。解析时，它们导入相应的模块并提取给定对象的docstring，将它们插入到页面源代码中的适当位置：rst:方向：`py:module`，：rst:方向：`py:class:etc.指令。

source: Just as :rst:dir:`py:class` respects the current :rst:dir:`py:module`, :rst:dir:`autoclass` will also do so. Likewise, :rst:dir:`automethod` will respect the current :rst:dir:`py:class`.
pt_br: Assim como :rst:dir:`py:class` respeita a corrente :rst:dir:`py:module`, :rst:dir:`autoclass` também o fará. Da mesma forma, :rst:dir:`automethod` respeitará a atual :rst:dir:`py:class`.
zh_cn: 就像：rst:方向：`py:class`尊重当前：rst:方向：`py:module`，：rst:方向：`autoclass`也会这样做。同样地：rst:方向：`automethod`将尊重当前：rst:方向：`py:class`。

source: Document a module, class or exception. All three directives will by default only insert the docstring of the object itself::
pt_br: Documente um módulo, classe ou exceção. Todas as três diretivas, por padrão, apenas inserem a docstring do próprio objeto::
zh_cn: 记录模块、类或异常。默认情况下，这三个指令都只插入对象本身的文档字符串:：

source: will produce source like this::
pt_br: vai produzir fonte assim::
zh_cn: 会产生这样的来源：

source: The "auto" directives can also contain content of their own, it will be inserted into the resulting non-auto directive source after the docstring (but before any automatic member documentation).
pt_br: As diretivas "auto" também podem conter conteúdo próprio, elas serão inseridas na fonte da diretiva não automática resultante após a docstring (mas antes de qualquer documentação de membro automática).
zh_cn: “auto”指令也可以包含自己的内容，它将被插入到文档字符串之后（但在任何自动成员文档之前）生成的非auto指令源中。

source: Therefore, you can also mix automatic and non-automatic member documentation, like so::
pt_br: Portanto, você também pode misturar documentação de membros automático e não automático, como::
zh_cn: 因此，您还可以混合使用自动和非自动成员文档，例如：

source: Options
pt_br: Opções
zh_cn: 选项

source: If set, autodoc will generate document for the members of the target module, class or exception.
pt_br: Se definido, autodoc vai gerar documento para os membros do exceção, classe ou módulo alvo.

source: For example::
pt_br: Por exemplo::
zh_cn: 例如：

source: will document all module members (recursively), and ::
pt_br: documentará todos os membros do módulo (recursivamente) e::
zh_cn: 将记录所有模块成员（递归），并且：

source: will document all class member methods and properties.
pt_br: vai documentar todos os métodos e propriedades de membro da classe.

source: By default, autodoc will not generate document for the members that are private, not having docstrings, inherited from super class, or special members.
pt_br: Por padrão, autodoc não vai gerar documento para os membros que são privados, não tendo docstrings, herdados a partir de uma superclasse ou membros especiais.

source: For modules, ``__all__`` will be respected when looking for members unless you give the ``ignore-module-all`` flag option. Without ``ignore-module-all``, the order of the members will also be the order in ``__all__``.
pt_br: Para módulos, ``__all__`` será respeitado ao procurar por membros, a menos que você forneça a opção de sinalizador ``ignore-module-all``. Sem ``ignore-module-all``, a ordem dos membros também será a ordem em ``__all__``.
zh_cn: 对于模块，在查找成员时，除非提供“ignore module all”标志选项，否则在查找成员时将考虑使用“ignore module all”标志选项。如果没有`ignore module all``，成员的顺序也将是`uuu all_uu2;`中的顺序。

source: You can also give an explicit list of members; only these will then be documented::
pt_br: Você também pode fornecer uma lista explícita de membros; somente estes serão então documentados::
zh_cn: 您也可以给出一个明确的成员列表；只有这些成员才会被记录下来：

source: If set, autodoc will also generate document for the members not having docstrings::
pt_br: Se definido, autodoc também gerará documento para os membros que não possuem docstrings::

source: If set, autodoc will also generate document for the private members (that is, those named like ``_private`` or ``__private``)::
pt_br: Se definido, autodoc também irá gerar documentos para os membros privados (ou seja, aqueles nomeados como ``_private`` ou ``__private``)::

source: It can also take an explicit list of member names to be documented as arguments::
pt_br: Também pode levar uma lista explícita de nomes de membros a serem documentados como argumentos::
zh_cn: 它还可以采用一个显式的成员名称列表作为参数进行记录：

source: The option can now take arguments.
pt_br: A opção agora pode receber argumentos.
zh_cn: 选项现在可以接受参数。

source: If set, autodoc will also generate document for the special members (that is, those named like ``__special__``)::
pt_br: Se definido, autodoc também irá gerar documentos para os membros especiais (ou seja, aqueles nomeados como ``__special__``) ::

source: The option can now take arguments
pt_br: Esta opção agora aceita argumentos

source: **Options and advanced usage**
pt_br: **Opções e uso avançado**
zh_cn: **选项和高级用法**

source: If you want to make the ``members`` option (or other options described below) the default, see :confval:`autodoc_default_options`.
pt_br: Se você deseja tornar a opção ``members`` (ou outras opções descritas abaixo) como padrão, consulte :confval:`autodoc_default_options`.
zh_cn: 如果要将“成员”选项（或下面描述的其他选项）设为默认选项，请参阅：confval:`autodoc_default_options`。

source: You can use a negated form, :samp:`'no-{flag}'`, as an option of autodoc directive, to disable it temporarily. For example::
pt_br: Você pode usar um formato negado, :samp:`'no-{flag}'`, como uma opção da diretiva ``autodoc``, para desativá-lo temporariamente. Por exemplo::
zh_cn: 您可以使用一个否定形式：samp:`'no-{flag}'`，作为autodoc指令的一个选项，暂时禁用它。例如：：

source: You can use autodoc directive options to temporarily override or extend default options which takes list as an input. For example::
pt_br: Você pode usar as opções de diretiva do autodoc para substituir ou estender temporariamente as opções padrão que usam a lista como uma entrada. Por exemplo::

source: The default options can be overridden or extended temporarily.
pt_br: As opções padrão podem ser substituídas ou estendidas temporariamente.

source: autodoc considers a member private if its docstring contains ``:meta private:`` in its :ref:`info-field-lists`. For example:
pt_br: autodoc considera um membro privado se sua docstring contém ``:meta private:`` em sua :ref:`info-field-lists`. Por exemplo:
zh_cn: 如果某个成员的docstring在其：ref:`info field list`中包含“`:meta private:`”，则autodoc将其视为私有成员。例如：

source: autodoc considers a member public if its docstring contains ``:meta public:`` in its :ref:`info-field-lists`, even if it starts with an underscore. For example:
pt_br: autodoc considera um membro público se sua docstring contém ``:meta public:`` em sua :ref:`info-field-lists`, mesmo se começar com um sublinhado. Por exemplo:
zh_cn: 如果某个成员的docstring在其：ref:`info field list`中包含“`:meta public:``”，即使它以下划线开头，它也会认为它是公共的。例如：

source: autodoc considers a variable member does not have any default value if its docstring contains ``:meta hide-value:`` in its :ref:`info-field-lists`. Example:
pt_br: autodoc considera que um membro variável não tem nenhum valor padrão se sua docstring contém ``:meta hide-value:`` em sua :ref:`info-field-lists`. Exemplo:

source: For classes and exceptions, members inherited from base classes will be left out when documenting all members, unless you give the ``inherited-members`` option, in addition to ``members``::
pt_br: Para classes e exceções, membros herdados de classes base serão deixados de fora ao documentar todos os membros, a menos que você forneça a opção ``inherited-members``, além de ``members`` ::
zh_cn: 对于类和异常，在记录所有成员时，从基类继承的成员将被忽略，除非除了“members”之外，还提供了“inherited members”选项：

source: This can be combined with ``undoc-members`` to document *all* available members of the class or module.
pt_br: Isso pode ser combinado com ``undoc-members`` para documentar *todos* os membros disponíveis da classe ou módulo.
zh_cn: 这可以与“非文档成员”结合使用，以记录类或模块的*所有*可用成员。

source: It can take an ancestor class not to document inherited members from it. By default, members of ``object`` class are not documented. To show them all, give ``None`` to the option.
pt_br: Pode ser necessária uma classe ancestral para não documentar membros herdados dela. Por padrão, os membros da classe ``object`` não são documentados. Para mostrá-los todos, dê ``None`` para a opção.
zh_cn: 它可以使用一个祖先类而不记录从它继承的成员。默认情况下，不记录“object”类的成员。要显示它们，请给选项“None”。

source: For example; If your class ``Foo`` is derived from ``list`` class and you don't want to document ``list.__len__()``, you should specify a option ``:inherited-members: list`` to avoid special members of list class.
pt_br: Por exemplo: se sua classe ``Foo`` é derivada da classe ``list`` e você não deseja documentar ``list.__len__()``, você deve especificar uma opção ``:inherited-members: list`` para evitar membros especiais da classe de lista.
zh_cn: 例如，如果您的类“Foo”是从“list”类派生而来的，并且您不想记录“list.\uu len_uuu9（）”，则应指定一个选项“`:inherited members:list`”，以避免列表类的特殊成员。

source: Another example; If your class Foo has ``__str__`` special method and autodoc directive has both ``inherited-members`` and ``special-members``, ``__str__`` will be documented as in the past, but other special method that are not implemented in your class ``Foo``.
pt_br: Outro exemplo: se sua classe Foo tem um método especial ``__str__`` e a diretiva autodoc tem ambos ``inherited-members`` e ``special-members``, ``__str__`` será documentado como no passado, mas outro método especial que não são implementados em sua classe ``Foo``.
zh_cn: 如果你的另一个特殊的'uuuu'和'uuu'方法都是特殊的'uuu'成员，但你的另一个特殊的'uuu'成员将被记录为另一个特殊的'uuu`成员，而你的另一个'uuu'方法将被记录为一个特殊的'uuu`成员，而你的另一个'uuuu'成员将被记录为一个特殊的'u``u`成员，而你的'uu'和'u``u都被特殊的'。

source: Since v5.0, it can take a comma separated list of ancestor classes. It allows to suppress inherited members of several classes on the module at once by specifying the option to :rst:dir:`automodule` directive.
pt_br: Desde a v5.0, ele pode receber uma lista separada por vírgulas de classes ancestrais. Ele permite suprimir membros herdados de várias classes no módulo de uma vez especificando a opção para a diretiva :rst:dir:`automodule`.

source: Note: this will lead to markup errors if the inherited members come from a module whose docstrings are not reST formatted.
pt_br: Nota: isso levará a erros de marcação se os membros herdados vierem de um módulo cujas docstrings não são formatadas em *reST*.
zh_cn: 注意：如果继承成员来自文档字符串不是reST格式的模块，这将导致标记错误。

source: It takes an ancestor class name as an argument.
pt_br: Leva um nome de classe ancestral como argumento.

source: It takes a comma separated list of ancestor class names.
pt_br: É preciso uma lista separada por vírgulas de nomes de classes ancestrais.

source: It's possible to override the signature for explicitly documented callable objects (functions, methods, classes) with the regular syntax that will override the signature gained from introspection::
pt_br: É possível substituir a assinatura de objetos chamáveis explicitamente (funções, métodos, classes) explicitamente com a sintaxe regular que irá substituir a assinatura obtida da introspecção::
zh_cn: 可以使用常规语法覆盖显式记录的可调用对象（函数、方法、类）的签名，该语法将覆盖从自省获得的签名：

source: This is useful if the signature from the method is hidden by a decorator.
pt_br: Isso é útil se a assinatura do método estiver oculta por um decorador.
zh_cn: 如果方法的签名被修饰符隐藏，这很有用。

source: The :rst:dir:`automodule`, :rst:dir:`autoclass` and :rst:dir:`autoexception` directives also support a flag option called ``show-inheritance``. When given, a list of base classes will be inserted just below the class signature (when used with :rst:dir:`automodule`, this will be inserted for every class that is documented in the module).
pt_br: As diretivas :rst:dir:`automodule`, :rst:dir:`autoclass` e :rst:dir:`autoexception` também oferecem suporte a um sinalizador opcional chamado ``show-inheritance``. Quando fornecida, uma lista de classes base será inserida logo abaixo da assinatura da classe (quando usada com :rst:dir:`automodule`, ela será inserida para cada classe documentada no módulo).
zh_cn: 这个：rst:方向：`自动模块'，：rst:方向：`自动类`和：rst:方向：`自动例外`指令还支持名为“展示继承”的标志选项。当给定时，基类列表将插入类签名的正下方（与：rst:方向：`自动模块`，这将为模块中记录的每个类插入）。

source: All autodoc directives support the ``no-index`` flag option that has the same effect as for standard :rst:dir:`py:function` etc. directives: no index entries are generated for the documented object (and all autodocumented members).
pt_br: Todas as diretivas autodoc oferecem suporte a um sinalizador opcional ``no-index`` que tem o mesmo efeito que as diretivas padrão :rst:dir:`py:function` etc.: nenhuma entrada de índice é gerada para o objeto documentado (e todos os membros autodocumentados).

source: :rst:dir:`automodule` also recognizes the ``synopsis``, ``platform`` and ``deprecated`` options that the standard :rst:dir:`py:module` directive supports.
pt_br: :rst:dir:`automodule` também reconhece as opções ``synopsis``, ``platform`` e ``deprecated`` à qual a diretiva padrão :rst:dir:`py:module` oferece suporte.
zh_cn: :rst:方向：`自动模块`还识别标准的“概要”、“平台”和“已弃用”选项：rst:方向：`py:模块`指令支持。

source: :rst:dir:`automodule` and :rst:dir:`autoclass` also has an ``member-order`` option that can be used to override the global value of :confval:`autodoc_member_order` for one directive.
pt_br: :rst:dir:`automodule` e :rst:dir:`autoclass` também tem uma opção ``member-order`` que pode ser usada para substituir o valor global de :confval:`autodoc_member_order` para uma diretiva.
zh_cn: :rst:方向：`自动模块`和：rst:方向：`自动类'还有一个“成员顺序r”选项，可用于重写一个指令的全局值：confval:`自动文档_成员_顺序'。

source: The directives supporting member documentation also have a ``exclude-members`` option that can be used to exclude single member names from documentation, if all members are to be documented.
pt_br: As diretivas que oferecem suporte à documentação do membro também têm uma opção ``exclude-members`` que pode ser usada para excluir nomes de membros únicos da documentação, se todos os membros tiverem que ser documentados.
zh_cn: 支持成员文档的指令还有一个“排除成员”选项，如果要记录所有成员，可以使用该选项从文档中排除单个成员名称。

source: In an :rst:dir:`automodule` directive with the ``members`` option set, only module members whose ``__module__`` attribute is equal to the module name as given to ``automodule`` will be documented. This is to prevent documentation of imported classes or functions. Set the ``imported-members`` option if you want to prevent this behavior and document all available members. Note that attributes from imported modules will not be documented, because attribute documentation is discovered by parsing the source file of the current module.
pt_br: Em uma diretiva :rst:dir:`automodule` com o conjunto de opções ``members``, apenas membros do módulo cujo atributo ``__module__`` é igual ao nome do módulo fornecido a ``automodule`` serão documentados. Isso evita a documentação de classes ou funções importadas. Defina a opção ``imported-members`` se você quiser evitar esse comportamento e documentar todos os membros disponíveis. Observe que os atributos dos módulos importados não serão documentados, porque a documentação de atributos é descoberta ao analisar o arquivo fonte do módulo atual.
zh_cn: 在一个：rst:方向：`自动模块`指令在设置了``成语啊``选项的情况下，只会记录其``eu 模块`u``属性等于给`自动模块`的模块名的模块成员。这是为了防止记录导入的类或函数。如果要阻止此行为并记录所有可用成员，请设置“导入成员”选项。请注意，导入模块中的属性不会被记录，因为属性文档是通过解析当前模块的源文件发现的。

source: Add a list of modules in the :confval:`autodoc_mock_imports` to prevent import errors to halt the building process when some external dependencies are not importable at build time.
pt_br: Adiciona uma lista de módulos no :confval:`autodoc_mock_imports` para evitar que os erros de importação interrompam o processo de construção quando algumas dependências externas não puderem ser importadas no momento da criação.
zh_cn: 在：confval:`自动文档_模拟_导入`中添加模块列表，以防止在生成时某些外部依赖项不可导入时发生导入错误，从而停止生成过程。
