Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/autodoc.po
Languages: pt_br, zh_cn

source: As a hint to autodoc extension, you can put a ``::`` separator in between module name and object name to let autodoc know the correct module name if it is ambiguous. ::
pt_br: Como uma dica para a extensão autodoc, você pode colocar um separador ``::`` entre o nome do módulo e o nome do objeto para permitir que o autodoc saiba o nome correto do módulo se for ambíguo. ::
zh_cn: 作为对autodoc扩展的提示，您可以在模块名和对象名之间放置一个“`：：`”分隔符，以便在模块名不明确时让autodoc知道正确的模块名。::

source: :rst:dir:`autoclass` also recognizes the ``class-doc-from`` option that can be used to override the global value of :confval:`autoclass_content`.
pt_br: :rst:dir:`autoclass` também reconhece a opção ``class-doc-from`` que pode ser usada para substituir o valor global de :confval:`autoclass_content`.

source: These work exactly like :rst:dir:`autoclass` etc., but do not offer the options used for automatic member documentation.
pt_br: Estas funcionam exatamente como :rst:dir:`autoclass` etc., mas não oferecem as opções usadas para documentação automática de membros.
zh_cn: 它们的工作原理与：rst:方向：`自动类`等，但不提供用于自动成员文档的选项。

source: :rst:dir:`autodata` and :rst:dir:`autoattribute` support the ``annotation`` option. The option controls how the value of variable is shown. If specified without arguments, only the name of the variable will be printed, and its value is not shown::
pt_br: :rst:dir:`autodata` e :rst:dir:`autoattribute` oferecem suporte à opção ``annotation``. A opção controla como o valor da variável é mostrado. Se especificado sem argumentos, apenas o nome da variável será impresso, e seu valor não é mostrado::
zh_cn: :rst:方向：`autodata`和：rst:方向：`autoattribute`支持`annotation``选项。该选项控制变量值的显示方式。如果不带参数指定，则只打印变量的名称，并且不显示其值：

source: If the option specified with arguments, it is printed after the name as a value of the variable::
pt_br: Se a opção for especificada com argumentos, ela é impressa após o nome como um valor da variável::
zh_cn: 如果使用参数指定选项，则将其作为变量的值打印在名称之后：

source: By default, without ``annotation`` option, Sphinx tries to obtain the value of the variable and print it after the name.
pt_br: Por padrão, sem a opção ``annotation``, Sphinx tenta obter o valor da variável e imprimi-lo após o nome.
zh_cn: 默认情况下，如果没有“annotation”选项，Sphinx会尝试获取变量的值并将其打印在名称之后。

source: The ``no-value`` option can be used instead of a blank ``annotation`` to show the type hint but not the value::
pt_br: A opção ``no-value`` pode ser usada em vez de uma ``annotation`` em branco para mostrar a dica de tipo, mas não o valor::

source: If both the ``annotation`` and ``no-value`` options are used, ``no-value`` has no effect.
pt_br: Se as opções ``annotation`` e ``no-value`` forem usadas, ``no-value`` tem nenhum efeito.

source: For module data members and class attributes, documentation can either be put into a comment with special formatting (using a ``#:`` to start the comment instead of just ``#``), or in a docstring *after* the definition. Comments need to be either on a line of their own *before* the definition, or immediately after the assignment *on the same line*. The latter form is restricted to one line only.
pt_br: Para membros de dados do módulo e atributos de classe, a documentação pode ser colocada em um comentário com formatação especial (usando ``#:`` para iniciar o comentário em vez de apenas ``#``) ou em uma docstring *após* a definição. Os comentários precisam estar em uma linha de sua própria definição, ou imediatamente após a atribuição *na mesma linha*. A última forma é restrita a apenas uma linha.
zh_cn: 对于模块数据成员和类属性，可以将文档放入具有特殊格式的注释中（使用`#：``来启动注释，而不仅仅是`#```），也可以放在定义之后的文档字符串*。注释必须在定义前*的行上，或者在赋值*后的同一行*。后一种形式仅限于一行。

source: This means that in the following class definition, all attributes can be autodocumented::
pt_br: Isso significa que, na definição de classe a seguir, todos os atributos podem ser autodocumentada::
zh_cn: 这意味着在下面的类定义中，可以自动记录所有属性：

source: :rst:dir:`autodata` and :rst:dir:`autoattribute` can now extract docstrings.
pt_br: :rst:dir:`autodata` e :rst:dir:`autoattribute` agora podem extrair docstrings.
zh_cn: :rst:方向：`自动数据`和：rst:方向：`自动属性`现在可以提取文档字符串。

source: Comment docs are now allowed on the same line after an assignment.
pt_br: Os documentos de comentários agora são permitidos na mesma linha após uma atribuição.
zh_cn: 现在允许在赋值后的同一行上添加注释文档。

source: :rst:dir:`autodata` and :rst:dir:`autoattribute` have an ``annotation`` option.
pt_br: :rst:dir:`autodata` e :rst:dir:`autoattribute` possuem uma opção ``annotation``.
zh_cn: 引用：`自动数据`和引用有``自动注解``选项的`自动属性`。

source: :rst:dir:`autodecorator` added.
pt_br: :rst:dir:`autodecorator` adicionado.
zh_cn: :rst:dir:`autodecorator` 已添加.

source: :rst:dir:`autoproperty` added.
pt_br: :rst:dir:`autoproperty` adicionado.

source: :rst:dir:`autodata` and :rst:dir:`autoattribute` now have a ``no-value`` option.
pt_br: :rst:dir:`autodata` e :rst:dir:`autoattribute` agora têm uma opção ``no-value``.

source: If you document decorated functions or methods, keep in mind that autodoc retrieves its docstrings by importing the module and inspecting the ``__doc__`` attribute of the given function or method. That means that if a decorator replaces the decorated function with another, it must copy the original ``__doc__`` to the new function.
pt_br: Se você documentar funções ou métodos decorados, tenha em mente que o autodoc obtém suas docstrings importando o módulo e inspecionando o atributo ``__doc__`` da função ou método dado. Isso significa que se um decorador substituir a função decorada por outra, deverá copiar o ``__doc__`` original para a nova função.
zh_cn: 如果您记录修饰过的函数或方法，请记住，autodoc通过导入模块并检查给定函数或方法的“`uuu 文档_uu2;”属性来检索其文档字符串。这意味着，如果一个装饰器用另一个函数替换装饰函数，它必须将原来的“uuu文档_uu2;”复制到新函数中。

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: There are also config values that you can set:
pt_br: Existem também valores de configuração que você pode definir:
zh_cn: 您还可以设置配置值：

source: This value selects what content will be inserted into the main body of an :rst:dir:`autoclass` directive. The possible values are:
pt_br: Este valor seleciona qual conteúdo será inserido no corpo principal de uma diretiva :rst:dir:`autoclass`. Os valores possíveis são:
zh_cn: 此值选择将插入到主体的内容：rst:方向：`自动类`指令。可能的值为：

source: Only the class' docstring is inserted. This is the default. You can still document ``__init__`` as a separate method using :rst:dir:`automethod` or the ``members`` option to :rst:dir:`autoclass`.
pt_br: Apenas a docstring da classe é inserida. Este é o padrão. Você ainda pode documentar ``__init__`` como um método separado usando :rst:dir:`automethod` ou a opção ``members`` para :rst:dir:`autoclass`.
zh_cn: 只插入类的文档字符串。这是默认值。您仍然可以使用以下方法将“`uuu 初始_u2;”作为单独的方法进行文档记录：rst:方向：`自动方法`或``成语那``选项用于：rst:方向：`自动类`。

source: Both the class' and the ``__init__`` method's docstring are concatenated and inserted.
pt_br: As docstrings da classe e do método ``__init__`` são concatenadas e inseridas.
zh_cn: 类和方法的文档字符串都被连接并插入。

source: Only the ``__init__`` method's docstring is inserted.
pt_br: Somente a docstring do método ``__init__`` é inserida.
zh_cn: 只插入方法的文档字符串。

source: If the class has no ``__init__`` method or if the ``__init__`` method's docstring is empty, but the class has a ``__new__`` method's docstring, it is used instead.
pt_br: Se a classe não tiver o método ``__init__`` ou se a docstring do método ``__init__`` estiver vazia, mas a classe tem a docstring do método ``__new__``, ela é usada no lugar.
zh_cn: 如果类没有```unu 初始``方法，或者如果```u 初始_u``方法的文档字符串为空，但该类有一个```unu 新\`方法的文档字符串，则改用它。

source: This value selects how the signature will be displayed for the class defined by :rst:dir:`autoclass` directive. The possible values are:
pt_br: Este valor seleciona como a assinatura será exibida para a classe definida pela diretiva :rst:dir:`autoclass`. Os valores possíveis são:

source: Display the signature with the class name.
pt_br: Exibe a assinatura com o nome da classe.

source: Display the signature as a method.
pt_br: Exibe a assinatura como um método.

source: The default is ``"mixed"``.
pt_br: O padrão é ``"mixed"``.

source: This value selects if automatically documented members are sorted alphabetical (value ``'alphabetical'``), by member type (value ``'groupwise'``) or by source order (value ``'bysource'``). The default is alphabetical.
pt_br: Esse valor seleciona se os membros documentados automaticamente são classificados em ordem alfabética (valor ``'alphabetical'``), por tipo de membro (valor ``'groupwise'``) ou por ordem de origem (valor ``'bysource'``). O padrão é alfabético.
zh_cn: 此值选择自动记录的成员是按字母顺序排序（值为“字母”），是按成员类型（值为“集团化”）还是按源顺序排序（值为“按源”）。默认值为字母顺序。

source: Note that for source order, the module must be a Python module with the source code available.
pt_br: Observe que, para a ordem de origem, o módulo deve ser um módulo Python com o código-fonte disponível.
zh_cn: 请注意，对于源代码顺序，该模块必须是具有可用源代码的Python模块。

source: Support for ``'bysource'``.
pt_br: Suporte para ``'bysource'``.
zh_cn: 支持“bysource”。

source: This value is a list of autodoc directive flags that should be automatically applied to all autodoc directives. The supported flags are ``'members'``, ``'undoc-members'``, ``'private-members'``, ``'special-members'``, ``'inherited-members'``, ``'show-inheritance'``, ``'ignore-module-all'`` and ``'exclude-members'``.
pt_br: Esse valor é uma lista de sinalizadores de diretivas do autodoc que devem ser aplicados automaticamente a todas as diretivas do autodoc. Os sinalizadores suportados são ``'members'``, ``'undoc-members'``, ``'private-members'``, ``'special-members'``, ``'inherited-members'``, ``'show-inheritance'``, ``'ignore-module-all'`` e ``'exclude-members'``.
zh_cn: 此值是自动应用于所有autodoc指令的autodoc指令标志的列表。受支持的标志是“'members'”、“'undoc-members'”、“'private-members'”、“'special-members'”、“'inherited-members'”、“'show-inheritation'”、“'ignore-module-all”和“exclude-members”`。

source: Integrated into :confval:`autodoc_default_options`.
pt_br: Integrado em :confval:`autodoc_default_options`.
zh_cn: 集成到：confval:`autodoc_default_options`。

source: The default options for autodoc directives. They are applied to all autodoc directives automatically. It must be a dictionary which maps option names to the values. For example::
pt_br: As opções padrão para diretivas do autodoc. Eles são aplicados a todas as diretivas do autodoc automaticamente. Deve ser um dicionário que mapeie os nomes das opções para os valores. Por exemplo::
zh_cn: autodoc指令的默认选项。它们将自动应用于所有autodoc指令。它必须是将选项名称映射到值的字典。例如：：

source: Setting ``None`` or ``True`` to the value is equivalent to giving only the option name to the directives.
pt_br: Definir ``None`` ou ``True`` como o valor é equivalente a fornecer apenas o nome da opção às diretivas.
zh_cn: 将“None”或“True”设置为值相当于只给指令指定选项名。

source: The supported options are ``'members'``, ``'member-order'``, ``'undoc-members'``, ``'private-members'``, ``'special-members'``, ``'inherited-members'``, ``'show-inheritance'``, ``'ignore-module-all'``, ``'imported-members'``, ``'exclude-members'``, ``'class-doc-from'`` and ``'no-value'``.
pt_br: As opções válidas são ``'members'``, ``'member-order'``, ``'undoc-members'``, ``'private-members'``, ``'special-members'``, ``'inherited-members'``, ``'show-inheritance'``, ``'ignore-module-all'``, ``'imported-members'``, ``'exclude-members'``, ``'class-doc-from'`` e ``'no-value'``.

source: Accepts ``True`` as a value.
pt_br: Aceita ``True`` como valor.
zh_cn: 接受“True”作为值。

source: Added ``'imported-members'``.
pt_br: Adicionado ``'imported-members'``.
zh_cn: 添加 ``'imported-members'``.

source: Added ``'class-doc-from'``.
pt_br: Adicionado ``'class-doc-from'``.

source: Added ``'no-value'``.
pt_br: Adicionado ``'no-value'``.

source: Functions imported from C modules cannot be introspected, and therefore the signature for such functions cannot be automatically determined. However, it is an often-used convention to put the signature into the first line of the function's docstring.
pt_br: As funções importadas dos módulos ``C`` não podem ser introspectivas e, portanto, a assinatura dessas funções não pode ser determinada automaticamente. No entanto, é uma convenção frequentemente usada para colocar a assinatura na primeira linha da docstring da função.
zh_cn: 从C模块导入的函数不能自省，因此不能自动确定这些函数的签名。但是，将签名放入函数的文档字符串的第一行是一个常用的约定。

source: If this boolean value is set to ``True`` (which is the default), autodoc will look at the first line of the docstring for functions and methods, and if it looks like a signature, use the line as the signature and remove it from the docstring content.
pt_br: Se este valor booleano é definido como ``True`` (que é o padrão), o autodoc irá olhar para a primeira linha da docstring para funções e métodos, e se parecer com uma assinatura, use a linha como assinatura e remova-a do conteúdo da docstring.
zh_cn: 如果此布尔值设置为“True”（默认值），自动文档将查看文档字符串的第一行以查找函数和方法，如果它看起来像签名，则使用该行作为签名，并将其从文档字符串内容中删除。

source: autodoc will continue to look for multiple signature lines, stopping at the first line that does not look like a signature. This is useful for declaring overloaded function signatures.
pt_br: autodoc continuará a procurar por várias linhas de assinatura, parando na primeira linha que não se parece com uma assinatura. Isso é útil para declarar assinaturas de função sobrecarregadas.

source: Support overloaded signatures
pt_br: Suporte a assinaturas sobrecarregadas
zh_cn: 支持重载签名

source: Overloaded signatures do not need to be separated by a backslash
pt_br: Assinaturas sobrecarregadas não precisam ser separadas por uma barra invertida

source: This value contains a list of modules to be mocked up. This is useful when some external dependencies are not met at build time and break the building process. You may only specify the root package of the dependencies themselves and omit the sub-modules:
pt_br: Este valor contém uma lista de módulos a serem reproduzidos. Isso é útil quando algumas dependências externas não são atendidas no momento da criação e interrompem o processo de construção. Você só pode especificar o pacote raiz das próprias dependências e omitir os submódulos:
zh_cn: 此值包含要模拟的模块列表。当某些外部依赖项在构建时不满足并中断构建过程时，这很有用。只能指定依赖项本身的根包，而忽略子模块：

source: Will mock all imports under the ``django`` package.
pt_br: Fará um mock de todas as importações sob o pacote ``django``.
zh_cn: 将模拟“django”包下的所有导入。

source: This config value only requires to declare the top-level modules that should be mocked.
pt_br: Esse valor de configuração requer apenas para declarar os módulos de nível superior que devem ser mockados.
zh_cn: 这个配置值只需要声明应该模拟的顶层模块。

source: This value controls how to represent typehints. The setting takes the following values:
pt_br: Este valor controla como representar dicas de tipo. A configuração presume os seguintes valores:

source: ``'signature'`` -- Show typehints in the signature (default)
pt_br: ``'signature'`` -- Mostra dicas de tipo na assinatura (padrão)

source: ``'description'`` -- Show typehints as content of the function or method The typehints of overloaded functions or methods will still be represented in the signature.
pt_br: ``'description'`` -- Mostra dicas de tipo como conteúdo da função ou método As dicas de tipo de funções ou métodos sobrecarregados ainda serão representadas na assinatura.

source: ``'none'`` -- Do not show typehints
pt_br: ``'none'`` -- Não mostra dicas de tipo
zh_cn: ``'none'`--不显示类型提示

source: ``'both'`` -- Show typehints in the signature and as content of the function or method
pt_br: ``'both'`` -- Mostra dicas de tipo na assinatura e como conteúdo da função ou método

source: Overloaded functions or methods will not have typehints included in the description because it is impossible to accurately represent all possible overloads as a list of parameters.
pt_br: Funções ou métodos sobrecarregados não terão dicas de tipo incluídas na descrição porque é impossível representar com precisão todas as sobrecargas possíveis como uma lista de parâmetros.

source: New option ``'description'`` is added.
pt_br: A nova opção ``'description'`` foi adicionada.
zh_cn: 添加了新选项“description”。

source: New option ``'both'`` is added.
pt_br: A nova opção ``'both'`` foi adicionada.

source: This value controls whether the types of undocumented parameters and return values are documented when ``autodoc_typehints`` is set to ``description``.
pt_br: Este valor controla se os tipos de parâmetros não documentados e valores de retorno são documentados quando ``autodoc_typehints`` é definido como ``description``.

source: The default value is ``"all"``, meaning that types are documented for all parameters and return values, whether they are documented or not.
pt_br: O valor padrão é ``"all"``, o que significa que os tipos são documentados para todos os parâmetros e valores de retorno, sejam eles documentados ou não.

source: When set to ``"documented"``, types will only be documented for a parameter or a return value that is already documented by the docstring.
pt_br: Quando definido como ``"documented"``, os tipos só serão documentados para um parâmetro ou valor de retorno que já está documentado pela docstring.

source: With ``"documented_params"``, parameter types will only be annotated if the parameter is documented in the docstring. The return type is always annotated (except if it is ``None``).
pt_br: Com ``"documented_params"``, os tipos de parâmetro só serão anotados se o parâmetro estiver documentado na docstring. O tipo de retorno é sempre anotado (exceto se for ``None``).

source: New option ``'documented_params'`` is added.
pt_br: Nova opção ``'documented_params'`` foi adicionada.

source: A dictionary for users defined `type aliases`__ that maps a type name to the full-qualified object name. It is used to keep type aliases not evaluated in the document. Defaults to empty (``{}``).
pt_br: Um dicionário para `apelidos de tipo`__ definidos pelos usuários que mapeia um nome de tipo para o nome de objeto totalmente qualificado. É usado para manter os apelidos de tipo não avaliados no documento. O padrão é vazio (``{}``).

source: The type aliases are only available if your program enables :pep:`Postponed Evaluation of Annotations (PEP 563) <563>` feature via ``from __future__ import annotations``.
pt_br: Os aliases de tipo só estão disponíveis se o seu programa habilitar o recurso :pep:`Avaliação Adiada de Anotações (PEP 563) <563>` via ``from __future__ import annotations``.

source: For example, there is code using a type alias::
pt_br: Por exemplo, aqui está um código usando um apelido de tipo::

source: If ``autodoc_type_aliases`` is not set, autodoc will generate internal mark-up from this code as following::
pt_br: Se ``autodoc_type_aliases`` não estiver definido, autodoc irá gerar marcação interna a partir deste código da seguinte forma::

source: If you set ``autodoc_type_aliases`` as ``{'AliasType': 'your.module.AliasType'}``, it generates the following document internally::
pt_br: Se você definir ``autodoc_type_aliases`` como ``{'AliasType': 'your.module.AliasType'}``, ele gera o seguinte documento internamente::

source: This value controls the format of typehints. The setting takes the following values:
pt_br: Este valor controla o formato das dicas de tipo. A configuração assume os seguintes valores:

source: ``'fully-qualified'`` -- Show the module name and its name of typehints
pt_br: ``'fully-qualified'`` -- Mostra o nome do módulo e seu nome de dicas de tipo

source: ``'short'`` -- Suppress the leading module names of the typehints (ex. ``io.StringIO`` -> ``StringIO``) (default)
pt_br: ``'short'`` -- Suprime os nomes dos módulos principais das dicas de tipo (p. ex., ``io.StringIO`` -> ``StringIO``) (padrão)

source: The default setting was changed to ``'short'``
pt_br: A configuração padrão foi alterada para ``'short'``

source: If True, the default argument values of functions will be not evaluated on generating document. It preserves them as is in the source code.
pt_br: Se for True, os valores de argumento padrão das funções não serão avaliados na geração do documento. Ele os preserva como estão no código-fonte.

source: Added as an experimental feature. This will be integrated into autodoc core in the future.
pt_br: Adicionado como um recurso experimental. Isso será integrado ao autodoc core no futuro.

source: This value controls the behavior of :option:`sphinx-build -W` during importing modules. If ``False`` is given, autodoc forcedly suppresses the error if the imported module emits warnings. By default, ``True``.
pt_br: Esse valor controla o comportamento de :option:`sphinx-build -W` durante a importação de módulos. Se ``False`` for fornecido, *autodoc* forçadamente suprime o erro se o módulo importado emitir avisos. Por padrão, ``True``.
zh_cn: 此值控制导入模块期间：option:`sphinx build-W`的行为。如果给定了“False”，则如果导入的模块发出警告，autodoc将强制取消该错误。默认为“True”。

source: This value controls the docstrings inheritance. If set to True the docstring for classes or methods, if not explicitly set, is inherited from parents.
pt_br: Este valor controla a herança de docstrings. Se definido como True, a docstring para classes ou métodos, se não for definida explicitamente, é herdada dos pais.
zh_cn: 此值控制docstrings继承。如果设置为True，则类或方法的docstring（如果未显式设置）将从父级继承。

source: The default is ``True``.
pt_br: O padrão é ``True``.
zh_cn: 默认值为真。

source: :mod:`autodoc` supports to suppress warning messages via :confval:`suppress_warnings`. It allows following warnings types in addition:
pt_br: :mod:`autodoc` oferece suporte à supressão de mensagens de aviso através de :confval:`suppress_warnings`. Ele permite seguir os seguintes tipos de avisos:
zh_cn: ：mod:`autodoc`支持通过：confval:`suppress_warnings`来取消警告消息。它还允许以下警告类型：

source: Docstring preprocessing
pt_br: Pré-processamento de docstrings
zh_cn: 文档字符串预处理

source: autodoc provides the following additional events:
pt_br: autodoc fornece os seguintes eventos adicionais:
zh_cn: 自动文档提供如下额外事件

source: Emitted when autodoc has read and processed a docstring. *lines* is a list of strings -- the lines of the processed docstring -- that the event handler can modify **in place** to change what Sphinx puts into the output.
pt_br: Emitido quando o autodoc leu e processou uma docstring. *lines* é uma lista de strings -- as linhas da docstring processada -- que o manipulador de eventos pode modificar **in place** para alterar o que o Sphinx coloca na saída.
zh_cn: 当自动文档读取并处理文档字符串时发出。*lines*是一个字符串列表，即已处理的文档字符串的行，事件处理程序可以修改**就地**以更改Sphinx在输出中的内容。

source: Parameters
pt_br: Parâmetros
zh_cn: 参数

source: the Sphinx application object
pt_br: o objeto do aplicativo Sphinx
zh_cn: sphinx应用目标

source: the type of the object which the docstring belongs to (one of ``"module"``, ``"class"``, ``"exception"``, ``"function"``, ``"method"``, ``"attribute"``)
pt_br: o tipo do objeto ao qual a docstring pertence (um dos ``"module"``, ``"class"``, ``"exception"``, ``"function"``, ``"method"``, ``"attribute"``)
zh_cn: 文档字符串所属对象的类型（“模块”、“类”、“异常”、“函数”、“方法”、“属性”之一）

source: the fully qualified name of the object
pt_br: o nome totalmente qualificado do objeto
zh_cn: 对象的完全限定名

source: the object itself
pt_br: o objeto em si
zh_cn: 对象自身

source: the options given to the directive: an object with attributes ``inherited_members``, ``undoc_members``, ``show_inheritance`` and ``no-index`` that are true if the flag option of same name was given to the auto directive
pt_br: as opções dadas à diretiva: um objeto com os atributos ``inherited_members``, ``undoc_members``, ``show_inheritance`` e ``no-index`` que são verdadeiros se a opção de sinalizador com o mesmo nome foi dada à diretiva auto

source: the lines of the docstring, see above
pt_br: as linhas da docstring, veja acima
zh_cn: 文档字符串的行，见上文
