Repository: ekaterina-n/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/extensions/intersphinx.po
Languages: pt_br

source: :mod:`sphinx.ext.intersphinx` -- Link to other projects' documentation
pt_br: :mod:`sphinx.ext.intersphinx` -- Link para documentação outros projetos

source: This extension can generate links to the documentation of objects in external projects, either explicitly through the :rst:role:`external` role, or as a fallback resolution for any other cross-reference.
pt_br: Esta extensão pode gerar links para a documentação de objetos em projetos externos, seja explicitamente através do papel :rst:role:`external`, ou como uma resolução de fallback para qualquer outra referência cruzada.

source: Usage for fallback resolution is simple: whenever Sphinx encounters a cross-reference that has no matching target in the current documentation set, it looks for targets in the external documentation sets configured in :confval:`intersphinx_mapping`. A reference like ``:py:class:`zipfile.ZipFile``` can then link to the Python documentation for the ZipFile class, without you having to specify where it is located exactly.
pt_br: O uso para resolução de fallback é simples: sempre que o Sphinx encontra uma referência cruzada que não tem um alvo correspondente no conjunto de documentação atual, ele procura alvos nos conjuntos de documentação externa configurados em :confval:`intersphinx_mapping`. Uma referência como ``:py:class:`zipfile.ZipFile``` pode ser vinculada à documentação do Python para a classe ZipFile, sem que você precise especificar onde ela está localizada exatamente.

source: When using the :rst:role:`external` role, you can force lookup to any external projects, and optionally to a specific external project. A link like ``:external:ref:`comparison manual <comparisons>``` will then link to the label "comparisons" in whichever configured external project, if it exists, and a link like ``:external+python:ref:`comparison manual <comparisons>``` will link to the label "comparisons" only in the doc set "python", if it exists.
pt_br: Ao usar o papel :rst:role:`external`, você pode forçar a pesquisa para qualquer projeto externo e, opcionalmente, para um projeto externo específico. Um link como ``:external:ref:`comparison manual <comparisons>``` será vinculado ao rótulo "comparações" em qualquer projeto externo configurado, se existir, e um link como ``:external+python:ref:`manual de comparação <comparisons>``` irá vincular ao rótulo "comparações" apenas no conjunto de documentos "python", se existir.

source: Behind the scenes, this works as follows:
pt_br: Por trás do palco, isso funciona como:

source: Each Sphinx HTML build creates a file named :file:`objects.inv` that contains a mapping from object names to URIs relative to the HTML set's root.
pt_br: Cada Sphinx HTML constrói um nome de arquivo chamado :file:`objects.inv` que contém o mapeamento dos nomes de objetos para URIs relativas a conjunto raiz HTML.

source: Projects using the Intersphinx extension can specify the location of such mapping files in the :confval:`intersphinx_mapping` config value. The mapping will then be used to resolve both :rst:role:`external` references, and also otherwise missing references to objects into links to the other documentation.
pt_br: Projetos usando a extensão Intersphinx podem especificar a localização de tais arquivos de mapeamento no valor de configuração :confval:`intersphinx_mapping`. O mapeamento será então usado para resolver ambas as referências :rst:role:`external`, e também referências ausentes a objetos em links para outra documentação.

source: By default, the mapping file is assumed to be at the same location as the rest of the documentation; however, the location of the mapping file can also be specified individually, e.g. if the docs should be buildable without Internet access.
pt_br: Por padrão, o mapeamento arquivo é assumido como no mesmo local da documentação; entretanto o local do mapeamento do arquivo também pode ser especificado individualmente, por exemplo, se o documento for construído sem acesso à internet.

source: Configuration
pt_br: Configuração

source: To use Intersphinx linking, add ``'sphinx.ext.intersphinx'`` to your :confval:`extensions` config value, and use these config values to activate linking:
pt_br: Para usar a ligação Intersphinx, adicione ``'sphinx.ext.intersphinx'`` ao seu valor de configuração :confval:`extensions`, e use estes valores de configuração para ativar a vinculação:

source: This config value contains the locations and names of other projects that should be linked to in this documentation.
pt_br: Esse valor config. irá conter os locais e nomes de outros projetos que podem ser ligadas a essa documentação.

source: Relative local paths for target locations are taken as relative to the base of the built documentation, while relative local paths for inventory locations are taken as relative to the source directory.
pt_br: Caminhos e locais relativos são assumidos como relativos a documentação base, enquanto caminhos relativos em locais inventariados são relativos ao diretório fonte.

source: When fetching remote inventory files, proxy settings will be read from the ``$HTTP_PROXY`` environment variable.
pt_br: Quando recuperando arquivos remotos, configurações de proxy irão ser lidas da variável de ambiente ``$HTTP_PROXY``.

source: **Format**
pt_br: **Formato**

source: A dictionary mapping unique identifiers to a tuple ``(target, inventory)``. Each ``target`` is the base URI of a foreign Sphinx documentation set and can be a local path or an HTTP URI. The ``inventory`` indicates where the inventory file can be found: it can be ``None`` (an :file:`objects.inv` file at the same location as the base URI) or another local file path or a full HTTP URI to an inventory file.
pt_br: Um dicionário mapeando identificadores exclusivos para uma tupla ``(target, inventory)``. Cada ``target`` é o URI base de um conjunto de documentação Sphinx estrangeira e pode ser um caminho local ou um URI HTTP. O ``inventory`` indica onde o arquivo de inventário pode ser encontrado: pode ser ``None`` (um arquivo :file:`objects.inv` no mesmo local que o URI base) ou outro caminho de arquivo local ou um URI HTTP completo para um arquivo de inventário.

source: The unique identifier can be used in the :rst:role:`external` role, so that it is clear which intersphinx set the target belongs to. A link like ``:external+python:ref:`comparison manual <comparisons>``` will link to the label "comparisons" in the doc set "python", if it exists.
pt_br: O identificador exclusivo pode ser usado no papel :rst:role:`external`, para que fique claro a qual interesphinx definido o alvo pertence. Um link como ``:external+python:ref:`comparison manual <comparisons>`` será vinculado ao rótulo "comparações" no conjunto de documentação "python", se existir.

source: **Example**
pt_br: **Exemplo**

source: To add links to modules and objects in the Python standard library documentation, use::
pt_br: Para adicionar ligações aos módulos e objetos na biblioteca documentação padrão Python, usar::

source: This will download the corresponding :file:`objects.inv` file from the Internet and generate links to the pages under the given URI. The downloaded inventory is cached in the Sphinx environment, so it must be re-downloaded whenever you do a full rebuild.
pt_br: Isso irá baixar arquivo correspondente a :file:`objects.inv` da internet e gerar links para as páginas sob determinada URI. O respectivo inventário é mantido em cache no ambiente Sphinx, portanto deve ser baixado novamente quando fizer um rebuild completo.

source: A second example, showing the meaning of a non-``None`` value of the second tuple item::
pt_br: Segundo exemplo, exibindo o significado de um valor não ``None`` no segundo item do par::

source: This will read the inventory from :file:`python-inv.txt` in the source directory, but still generate links to the pages under ``https://docs.python.org/3``. It is up to you to update the inventory file as new objects are added to the Python documentation.
pt_br: Isso irá ler o inventário de :file:`python-inv.txt` no diretório de origem, mas ainda gerará links para as páginas em ``https://docs.python.org/3``. Cabe a você atualizar o arquivo de inventário à medida que novos objetos são adicionados à documentação do Python.

source: **Multiple targets for the inventory**
pt_br: **Vários alvos para o inventário**

source: Alternative files can be specified for each inventory. One can give a tuple for the second inventory tuple item as shown in the following example. This will read the inventory iterating through the (second) tuple items until the first successful fetch. The primary use case for this to specify mirror sites for server downtime of the primary inventory::
pt_br: Arquivos alternativos podem ser especificados para cada inventário. Alguém pode ter um par como segunda opção como no seguinte exemplo. Irá ler o inventário interagindo através do segundo par do conjunto até que ocorra a primeira recuperação com sucesso. Uso principal disso é para especificar espelhos quando o servidor primário estiver fora de serviço::

source: For a set of books edited and tested locally and then published together, it could be helpful to try a local inventory file first, to check references before publication::
pt_br: Para um conjunto de livros editados e testados localmente e depois publicados juntos, pode ser útil experimentar primeiro um arquivo de inventário local, para verificar as referências antes da publicação::

source: If provided, :confval:`!intersphinx_resolve_self` overrides intersphinx's resolution mechanism to resolve all references to the current project, rather than an external reference. This is useful when documentation is shared between projects, with the 'upstream' or 'parent' project using intersphinx-style references in its documentation. For example, a project such as *Astropy* might set:
pt_br: Se fornecido, :confval:`!intersphinx_resolve_self` substitui o mecanismo de resolução do intersphinx para resolver todas as referências ao projeto atual, em vez de uma referência externa. Isso é útil quando a documentação é compartilhada entre projetos, com o projeto 'upstream' ou 'parent' usando referências no estilo intersphinx em sua documentação. Por exemplo, um projeto como *Astropy* pode definir:

source: Projects re-using *Astropy*'s documentation or inheriting their docstrings would then configure their :confval:`!intersphinx_mapping` with an :code-py:`'astropy'` key, pointing to *astropy*'s :file:`objects.inv`. For example:
pt_br: Projetos que reutilizam a documentação do *Astropy* ou herdam suas docstrings configurariam então seu :confval:`!intersphinx_mapping` com uma chave :code-py:`'astropy'`, apontando para :file:`objects.inv` do *astropy*. Por exemplo:

source: The maximum number of days to cache remote inventories. Set this to a negative value to cache inventories for unlimited time.
pt_br: O número máximo de dias para manter em cache inventários. Defina isso para um valor negativo para manter inventários por tempo indeterminado.

source: The number of seconds for timeout. Use ``None`` for no timeout.
pt_br: O número de segundos para o tempo limite. Use ``None`` para nenhum tempo limite.

source: timeout is not a time limit on the entire response download; rather, an exception is raised if the server has not issued a response for *timeout* seconds.
pt_br: o timeout não é um limite de tempo para todo o download da resposta; em vez disso, uma exceção é levantada se o servidor não tiver emitido uma resposta para os segundos de *timeout*.

source: Changed default value from an empty list to ``['std:doc']``.
pt_br: Valor padrão alterado de uma lista vazia para ``['std:doc']``.

source: A list of strings being either:
pt_br: Uma lista de strings sendo:

source: the name of a specific reference type in a domain, e.g., ``std:doc``, ``py:func``, or ``cpp:class``,
pt_br: o nome de um tipo de referência específica em um domínio, p. ex., ``std:doc``, ``py:func`` ou ``cpp:class``,

source: the name of a domain, and a wildcard, e.g., ``std:*``, ``py:*``, or ``cpp:*``, or
pt_br: o nome de um domínio e um coringa, p. e.g., ``std:*``, ``py:*`` ou ``cpp:*``, ou

source: simply a wildcard ``*``.
pt_br: simplesmente um coringa ``*``.

source: When a non-:rst:role:`external` cross-reference is being resolved by intersphinx, skip resolution if it matches one of the specifications in this list.
pt_br: Quando uma referência cruzada não-:rst:role:`external` estiver sendo resolvida por interesphinxes, pule a resolução se ela corresponder a uma das especificações nesta lista.

source: For example, with ``intersphinx_disabled_reftypes = ['std:doc']`` a cross-reference ``:doc:`installation``` will not be attempted to be resolved by intersphinx, but ``:external+otherbook:doc:`installation``` will be attempted to be resolved in the inventory named ``otherbook`` in :confval:`intersphinx_mapping`. At the same time, all cross-references generated in, e.g., Python, declarations will still be attempted to be resolved by intersphinx.
pt_br: Por exemplo, com ``intersphinx_disabled_reftypes = ['std:doc']`` uma referência cruzada ``:doc:`installation``` não será tentada para ser resolvida por intersphinx, mas ``:external+otherbook:doc:`installation``` será tentado a ser resolvido no inventário chamado ``otherbook`` em :confval:`intersphinx_mapping`. Ao mesmo tempo, todas as referências cruzadas geradas em, por exemplo, declarações do Python, ainda serão tentadas para serem resolvidas por interesphinx.

source: If ``*`` is in the list of domains, then no non-:rst:role:`external` references will be resolved by intersphinx.
pt_br: Se ``*`` estiver na lista de domínios, nenhuma referência não-:rst:role:`external` será resolvida por intersphinx.

source: Explicitly Reference External Objects
pt_br: Referenciar explicitamente objetos externos

source: The Intersphinx extension provides the following role.
pt_br: A extensão Intersphinx fornece o seguinte papel.

source: Use Intersphinx to perform lookup only in external projects, and not the current project. Intersphinx still needs to know the type of object you would like to find, so the general form of this role is to write the cross-refererence as if the object is in the current project, but then prefix it with ``:external``. The two forms are then
pt_br: Use o Intersphinx para realizar a pesquisa apenas em projetos externos e não no projeto atual. O Intersphinx ainda precisa saber o tipo de objeto que você gostaria de encontrar, então a forma geral desse papel é escrever a referência cruzada como se o objeto estivesse no projeto atual, mas depois prefixe-o com ``:external`` . As duas formas são então

source: ``:external:domain:reftype:`target```, e.g., ``:external:py:class:`zipfile.ZipFile```, or
pt_br: ``:external:domain:reftype:`alvo```, p. ex., ``:external:py:class:`zipfile.ZipFile```, ou

source: ``:external:reftype:`target```, e.g., ``:external:doc:`installation```. With this shorthand, the domain is assumed to be ``std``.
pt_br: ``:external:reftype:`target```, por exemplo ``:external:doc:`installation```. Com este atalho, o domínio é assumido como ``std``.

source: If you would like to constrain the lookup to a specific external project, then the key of the project, as specified in :confval:`intersphinx_mapping`, is added as well to get the two forms
pt_br: Se você deseja restringir a pesquisa a um projeto externo específico, a chave do projeto, conforme especificado em :confval:`intersphinx_mapping`, também é adicionada para obter os dois formulários

source: ``:external+invname:domain:reftype:`target```, e.g., ``:external+python:py:class:`zipfile.ZipFile```, or
pt_br: ``:external+invname:domain:reftype:`alvo```, p. ex., ``:external+python:py:class:`zipfile.ZipFile``` ou

source: ``:external+invname:reftype:`target```, e.g., ``:external+python:doc:`installation```.
pt_br: ``:external+invname:reftype:`alvo```, p. ex., ``:external+python:doc:`installation```.

source: Showing all links of an Intersphinx mapping file
pt_br: Mostrando todos os links de um arquivo de mapeamento Intersphinx

source: To show all Intersphinx links and their targets of an Intersphinx mapping file, run ``python -m sphinx.ext.intersphinx url-or-path``. This is helpful when searching for the root cause of a broken Intersphinx link in a documentation project. The following example prints the Intersphinx mapping of the Python documentation:
pt_br: Para mostrar todos os links Intersphinx e seus alvos de um arquivo de mapeamento Intersphinx, execute ``python -m sphinx.ext.intersphinx url-or-path``. Isso é útil ao procurar a causa raiz de um link Intersphinx quebrado em um projeto de documentação. O exemplo a seguir imprime o mapeamento Intersphinx da documentação do Python::

source: Using Intersphinx with inventory file under Basic Authorization
pt_br: Usando Intersphinx com arquivo de inventário sob autorização básica

source: Intersphinx supports Basic Authorization like this::
pt_br: Intersphinx oferece suporte a autorização básica assim::

source: The user and password will be stripped from the URL when generating the links.
pt_br: O usuário e a senha serão retirados da URL ao gerar os links.
