Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/markup/toctree.po
Languages: pt_br

source: The TOC tree
pt_br: A rais TOC

source: Since reST does not have facilities to interconnect several documents, or split documents into multiple output files, Sphinx uses a custom directive to add relations between the single files the documentation is made of, as well as tables of contents. The ``toctree`` directive is the central element.
pt_br: Como reST não tem funcionalidades para conectar diversos documentos ou dividir documentos em múltiplos arquivos de saída, Sphinx usa uma diretiva configurada para adicionar relações entre arquivos simples da documentação criada e de tabelas de conteúdos. A diretiva ``toctree`` é um elemento central.

source: Simple "inclusion" of one file in another can be done with the :dudir:`include` directive.
pt_br: A simples "inclusão" de um arquivo em outro pode ser feita com a diretiva :dudir:`include`.

source: This directive inserts a "TOC tree" at the current location, using the individual TOCs (including "sub-TOC trees") of the documents given in the directive body. Relative document names (not beginning with a slash) are relative to the document the directive occurs in, absolute names are relative to the source directory. A numeric ``maxdepth`` option may be given to indicate the depth of the tree; by default, all levels are included. [#]_
pt_br: Esta diretiva insere uma "árvore TOC" na localização atual, usando os TOCs individuais (incluindo "árvores subTOC") dos documentos fornecidos no corpo da diretiva. Os nomes de documentos relativos (não começando com uma barra) são relativos ao documento em que a diretiva ocorre, os nomes absolutos são relativos ao diretório fonte. Uma opção numérica ``maxdepth`` pode ser fornecida para indicar a profundidade da árvore; por padrão, todos os níveis são incluídos. [#]_

source: Consider this example (taken from the Python docs' library reference index)::
pt_br: Considere esse exemplo (obtido da biblioteca de Doc. Python, índice ref.)::

source: This accomplishes two things:
pt_br: Serve para dois objetivos::

source: Tables of contents from all those documents are inserted, with a maximum depth of two, that means one nested heading. ``toctree`` directives in those documents are also taken into account.
pt_br: Tableas de conteúdos para todos os documentos que forem inseridos, com um nível máximo de profundidade de dois, o que significa um subnível de cabeçalho. Diretivas ``toctree`` nesses documentos também são levadas em conta.

source: Sphinx knows the relative order of the documents ``intro``, ``strings`` and so forth, and it knows that they are children of the shown document, the library index. From this information it generates "next chapter", "previous chapter" and "parent chapter" links.
pt_br: O Sphinx conhece a ordem relativa dos documentos ``intro``, ``strings`` e assim por diante, e sabe que eles são filhos do documento mostrado, o índice da biblioteca. A partir dessas informações, ele gera os links "próximo capítulo", "capítulo anterior" e "capítulo pai".

source: **Entries**
pt_br: **Entradas**

source: Document titles in the :rst:dir:`toctree` will be automatically read from the title of the referenced document. If that isn't what you want, you can specify an explicit title and target using a similar syntax to reST hyperlinks (and Sphinx's :ref:`cross-referencing syntax <xref-syntax>`). This looks like::
pt_br: Os títulos dos documentos em :rst:dir:`toctree` serão lidos automaticamente a partir do título do documento referenciado. Se isso não for o que você deseja, você pode especificar um título e destino explícitos usando uma sintaxe semelhante para hiperlinks de reST (e :ref:`sintaxe de referência cruzada <xref-syntax>` do Sphinx). Isso se parece com::

source: The second line above will link to the ``strings`` document, but will use the title "All about strings" instead of the title of the ``strings`` document.
pt_br: A segunda linha acima terá um link para o documento ``strings``, mas usará o título "All about strings" ao invés do título do documento ``strings``.

source: You can also add external links, by giving an HTTP URL instead of a document name.
pt_br: Podem ser adicionados links externos, através de URL HTTP em vez do nome de documento.

source: **Section numbering**
pt_br: **Numeração Seção**

source: If you want to have section numbers even in HTML output, give the **toplevel** toctree a ``numbered`` option. For example::
pt_br: Se desejar números nas seções no HTML de saída, atribua um toctree **toplevel** com opção ``numbered``. Por exemplo::

source: Numbering then starts at the heading of ``foo``. Sub-toctrees are automatically numbered (don't give the ``numbered`` flag to those).
pt_br: A numeração então começa no cabeçalho de ``foo``. Sub-toctrees são numeradas automaticamente (não dê o sinalizador ``numbered`` para elas).

source: Numbering up to a specific depth is also possible, by giving the depth as a numeric argument to ``numbered``.
pt_br: Numerar até uma profundidade específica também é possível, dando a profundidade como um argumento numérico para ``numbered``.

source: **Additional options**
pt_br: **Opções adicionais**

source: You can use ``caption`` option to provide a toctree caption and you can use ``name`` option to provide implicit target name that can be referenced by using :rst:role:`ref`::
pt_br: Você pode usar a opção ``caption`` para fornecer uma legenda à toctree e você pode usar a opção ``name`` para fornecer um nome de destino implícito que pode ser referenciado usando :rst:role:`ref`::

source: If you want only the titles of documents in the tree to show up, not other headings of the same level, you can use the ``titlesonly`` option::
pt_br: Se você quiser que apareçam apenas os títulos dos documentos na árvore, e não outros títulos do mesmo nível, você pode usar a opção ``títulosonly``::

source: You can use "globbing" in toctree directives, by giving the ``glob`` flag option. All entries are then matched against the list of available documents, and matches are inserted into the list alphabetically. Example::
pt_br: Você pode usar "globbing" nas diretivas toctree, dando a opção de sinalização ``glob``. Todas as entradas são então comparadas com a lista de documentos disponíveis e as correspondências são inseridas na lista em ordem alfabética. Exemplo::

source: This includes first all documents whose names start with ``intro``, then all documents in the ``recipe`` folder, then all remaining documents (except the one containing the directive, of course.) [#]_
pt_br: Isso inclui primeiro todos os documentos cujos nomes começam com ``intro``, depois todos os documentos na pasta ``recipe`` e, em seguida, todos os documentos restantes (exceto aquele que contém a diretiva, é claro). [#]_

source: The special entry name ``self`` stands for the document containing the toctree directive. This is useful if you want to generate a "sitemap" from the toctree.
pt_br: O nome de entrada especial ``self`` representa o documento que contém a diretiva toctree. Isso é útil se você deseja gerar um "sitemap" a partir da toctree.

source: You can use the ``reversed`` flag option to reverse the order of the entries in the list. This can be useful when using the ``glob`` flag option to reverse the ordering of the files. Example::
pt_br: Você pode usar a opção de sinalizador ``reversed`` para inverter a ordem das entradas na lista. Isso pode ser útil ao usar a opção de sinalizador ``glob`` para inverter a ordem dos arquivos. Exemplo::

source: You can also give a "hidden" option to the directive, like this::
pt_br: Você também pode fornecer uma opção "oculta" para a diretiva, como esta::

source: This will still notify Sphinx of the document hierarchy, but not insert links into the document at the location of the directive -- this makes sense if you intend to insert these links yourself, in a different style, or in the HTML sidebar.
pt_br: Isso ainda notificará o Sphinx sobre a hierarquia do documento, mas não inserirá links no documento no local da diretiva -- isso faz sentido se você pretende inserir esses links por conta própria, em um estilo diferente ou na barra lateral HTML.

source: In cases where you want to have only one top-level toctree and hide all other lower level toctrees you can add the "includehidden" option to the top-level toctree entry::
pt_br: Nos casos em que você deseja ter apenas uma árvore toctree de nível superior e ocultar todas as outras toctree de nível inferior, você pode adicionar a opção "includehidden" à entrada toctree de nível superior::

source: All other toctree entries can then be eliminated by the "hidden" option.
pt_br: Todas demais entradas da toctree podem ser omitidas com a opção "hidden".

source: In the end, all documents in the :term:`source directory` (or subdirectories) must occur in some ``toctree`` directive; Sphinx will emit a warning if it finds a file that is not included, because that means that this file will not be reachable through standard navigation.
pt_br: No final, todos os documentos no :term:`diretório fonte` (ou subdiretórios) devem ocorrer em alguma diretiva ``toctree``; O Sphinx emitirá um aviso se encontrar um arquivo que não está incluído, porque isso significa que esse arquivo não será acessível através da navegação padrão.

source: Use :confval:`exclude_patterns` to explicitly exclude documents or directories from building completely. Use :ref:`the "orphan" metadata <metadata>` to let a document be built, but notify Sphinx that it is not reachable via a toctree.
pt_br: Usa :confval:`exclude_patterns` para excluir explicitamente documentos ou diretórios da construção completamente. Usa :ref:`os metadados "órfãos" <metadata>` para permitir que um documento seja construído, mas notifica o Sphinx de que não está acessível através de uma toctree.

source: The "master document" (selected by :confval:`master_doc`) is the "root" of the TOC tree hierarchy. It can be used as the documentation's main page, or as a "full table of contents" if you don't give a ``maxdepth`` option.
pt_br: O "documento mestre" (selecionado por :confval:`master_doc`) é a "raiz" da hierarquia da árvore TOC. Ele pode ser usado como a página principal da documentação ou como um "índice completo" se você não fornecer a opção ``maxdepth``.

source: Added "globbing" option.
pt_br: Opção "globbing" adicionada.

source: Added "numbered" and "hidden" options as well as external links and support for "self" references.
pt_br: Adicionadas opções "numbered" e "hidden" bem como links externos e suporte para referências "self".

source: Added "titlesonly" option.
pt_br: Adic. opção "titlesonly".

source: Added numeric argument to "numbered".
pt_br: Adic. argumento numérico para "numbered".

source: Added "includehidden" option.
pt_br: Adic. opção "includehidden".

source: Added "caption" and "name" option.
pt_br: Adic. opção "caption" e "name".

source: Special names
pt_br: Nomes Especiais

source: Sphinx reserves some document names for its own use; you should not try to create documents with these names -- it will cause problems.
pt_br: Sphinx reserva alguns nomes de documentos para seu próprio uso; não tente criar documentos usando esses nomes - isso irá causar problemas.

source: The special document names (and pages generated for them) are:
pt_br: Nomes especiais de documentos (e páginas geradas para eles) são:

source: These are used for the general index, the Python module index, and the search page, respectively.
pt_br: São usadas respectivamente nas opções para índice geral, índice módulo Python e página de pesquisa.

source: The general index is populated with entries from modules, all index-generating :ref:`object descriptions <basic-domain-markup>`, and from :rst:dir:`index` directives.
pt_br: O índice geral e preenchido com entradas dos módulos, todas gerações de índices :ref:`object descriptions <basic-domain-markup>`, e para diretivas de :rst:dir:`index`.

source: The Python module index contains one entry per :rst:dir:`py:module` directive.
pt_br: O módulo Python index contém uma entrada por diretiva :rst:dir:`py:module`.

source: The search page contains a form that uses the generated JSON search index and JavaScript to full-text search the generated documents for search words; it should work on every major browser that supports modern JavaScript.
pt_br: A página de pesquisa contém um formulário que usa índice pesquisa em JSON e JavaScript para busca integral de texto para palavras existentes; normalmente funciona nos diversos navegadores que suportam JavaScript Moderno.

source: every name beginning with ``_``
pt_br: todo nome começando com ``_``

source: Though only few such names are currently used by Sphinx, you should not create documents or document-containing directories with such names. (Using ``_`` as a prefix for a custom template directory is fine.)
pt_br: Embora apenas poucos desses nomes sejam usados atualmente pelo Sphinx, você não deve criar documentos ou diretórios que contenham documentos com esses nomes. (Usar ``_`` como um prefixo para um diretório de modelo personalizado é adequado.)

source: Be careful with unusual characters in filenames. Some formats may interpret these characters in unexpected ways:
pt_br: Tenha cuidado com caracteres incomuns em nomes de arquivos. Alguns formatos podem interpretar esses caracteres de maneiras inesperadas:

source: Do not use the colon ``:`` for HTML based formats. Links to other parts may not work.
pt_br: Não usar dois pontos ``:`` para formatos base HTML. Links para outras partes podem não funcionar.

source: Do not use the plus ``+`` for the ePub format. Some resources may not be found.
pt_br: Não usar o sinal mais ``+`` no formato ePub. Alguns recursos podem não ser encontrados.

source: Footnotes
pt_br: Notas de Rodapé

source: The LaTeX writer only refers the ``maxdepth`` option of first toctree directive in the document.
pt_br: O construtor LaTeX só usa a opção ``maxdepth`` para a primeira diretiva toctree do documento.

source: A note on available globbing syntax: you can use the standard shell constructs ``*``, ``?``, ``[...]`` and ``[!...]`` with the feature that these all don't match slashes. A double star ``**`` can be used to match any sequence of characters *including* slashes.
pt_br: Anotação sobre sintaxe global disponível: podem ser usadas construções ``*``, ``?``, ``[...]`` e ``[!...]`` com funcionalidade que não combinem com barras. Asterisco duplo ``**`` pode ser usada para combinar com qualquer sequência de caracteres *incluindo* barras.
