Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/advanced/setuptools.po
Languages: pt_br

source: Setuptools integration
pt_br: Integração Setuptools

source: Sphinx supports integration with setuptools and distutils through a custom command - :class:`~sphinx.setup_command.BuildDoc`.
pt_br: Sphinx suporta integração com setuptools e distutils através de comando personalizado - :class:`~sphinx.setup_command.BuildDoc`.

source: This feature will be removed in v7.0.
pt_br: Este recurso será removido na v7.0.

source: Using setuptools integration
pt_br: Usando integração setuptools

source: The Sphinx build can then be triggered from distutils, and some Sphinx options can be set in ``setup.py`` or ``setup.cfg`` instead of Sphinx's own configuration file.
pt_br: A construção do ``Sphinx`` pode então ser disparada a partir de ``distutils``, e algumas opções do ``Sphinx`` podem ser configuradas em ``setup.py`` ou ``setup.cfg`` em vez do próprio arquivo de configuração do ``Sphinx``.

source: For instance, from ``setup.py``::
pt_br: Por exemplo, de ``setup.py``::

source: If you set Sphinx options directly in the ``setup()`` command, replace hyphens in variable names with underscores. In the example above, ``source-dir`` becomes ``source_dir``.
pt_br: Se você definir as opções do ``Sphinx`` diretamente no comando ``setup()``, substitua os hifens em nomes de variáveis por sublinhados. No exemplo acima, ``source-dir`` se torna ``source_dir``.

source: Or add this section in ``setup.cfg``::
pt_br: Ou adicione esta seção em ``setup.cfg``::

source: Once configured, call this by calling the relevant command on ``setup.py``::
pt_br: Uma vez configurado, chame isso chamando o comando relevante em ``setup.py``::

source: Options for setuptools integration
pt_br: Opções para integração setuptools

source: A boolean that determines whether the saved environment should be discarded on build. Default is false.
pt_br: Um booleano que determina se o ambiente salvo deve ser descartado na compilação. O padrão é ``False``.

source: This can also be set by passing the `-E` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a flag `-E` para ``setup.py``:

source: A boolean that determines whether all files should be built from scratch. Default is false.
pt_br: Um booleano que determina se todos os arquivos devem ser construídos do zero. O padrão é ``False``.

source: This can also be set by passing the `-a` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a flag `-a` para ``setup.py``:

source: The target source directory. This can be relative to the ``setup.py`` or ``setup.cfg`` file, or it can be absolute. It defaults to ``./doc`` or ``./docs`` if either contains a file named ``conf.py`` (checking ``./doc`` first); otherwise it defaults to the current directory.
pt_br: O diretório de origem do destino. Isso pode ser relativo ao arquivo ``setup.py`` ou ``setup.cfg``, ou pode ser absoluto. O padrão é ``./doc`` ou ``./docs`` se ambos contiverem um arquivo chamado ``conf.py`` (verificando ``./doc`` primeiro); caso contrário, o padrão será o diretório atual.

source: This can also be set by passing the `-s` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a flag `-s` para ``setup.py``:

source: The target build directory. This can be relative to the ``setup.py`` or ``setup.cfg`` file, or it can be absolute. Default is ``./build/sphinx``.
pt_br: O diretório de construção de destino. Isso pode ser relativo ao arquivo ``setup.py`` ou ``setup.cfg``, ou pode ser absoluto. O padrão é ``./build/sphinx``.

source: Location of the configuration directory. This can be relative to the ``setup.py`` or ``setup.cfg`` file, or it can be absolute. Default is to use `source-dir`.
pt_br: Localização do diretório de configuração. Isso pode ser relativo ao arquivo ``setup.py`` ou ``setup.cfg``, ou pode ser absoluto. O padrão é usar `source-dir`.

source: This can also be set by passing the `-c` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a flag `-c` para ``setup.py``:

source: The builder or list of builders to use. Default is ``html``.
pt_br: O construtor ou lista de construtores a serem usados. O padrão é ``html``.

source: This can also be set by passing the `-b` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a ``flag`` `-b` para o ``setup.py``:

source: This can now be a comma- or space-separated list of builders
pt_br: Agora, isso pode ser uma lista separada por vírgula ou espaço de construtores

source: A boolean that ensures Sphinx warnings will result in a failed build. Default is false.
pt_br: Um booleano que garanta avisos do ``Sphinx`` resultará em uma falha na construção. O padrão é ``False``.

source: This can also be set by passing the `-W` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a flag `-W` para ``setup.py``:

source: The documented project's name. Default is ``''``.
pt_br: Nome do documento do Projeto. padrão é ``''``.

source: The short X.Y version. Default is ``''``.
pt_br: A versão curta do X.Y. O padrão é ``''``.

source: The full version, including alpha/beta/rc tags. Default is ``''``.
pt_br: A versão completa, incluindo tags alfa/beta/rc. O padrão é ``''``.

source: How to format the current date, used as the replacement for ``|today|``. Default is ``''``.
pt_br: Como formatar a data atual, usada como substituta para ``|today|``. O padrão é ``''``.

source: A boolean that ensures index.html will be linked to the root doc. Default is false.
pt_br: Um booleano que garante que index.html será vinculado ao documento raiz. O padrão é falso.

source: This can also be set by passing the `-i` flag to ``setup.py``:
pt_br: Isso também pode ser definido passando a flag `-i` para ``setup.py``:

source: The copyright string. Default is ``''``.
pt_br: String de Direito Autoral. Padrão é ``''``.

source: Run in nit-picky mode. Currently, this generates warnings for all missing references. See the config value :confval:`nitpick_ignore` for a way to exclude some references as "known missing".
pt_br: Executar no modo nit-picky. Atualmente, isso gera avisos para todas as referências inexistentes. Ver valor config :confval:`nitpick_ignore` para não exibir referências conhecidas como "inexistentes conhecidos".

source: A boolean to configure ``pdb`` on exception. Default is false.
pt_br: Um booleano para configurar ``pd`` na exceção. O padrão é ``False``.
