Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/installation.po
Languages: fr

source: Installing Sphinx
fr: Installer Sphinx

source: Overview
fr: Résumé

source: Install either ``python3-sphinx`` using :command:`apt-get`:
fr: Intallez ``python3-sphinx`` en utilisant :command:`apt-get` :

source: If it not already present, this will install Python for you.
fr: S'il n'est pas déjà présent, ceci installera Python pour vous.

source: Install ``python-sphinx`` using :command:`yum`:
fr: Installez ``python-sphinx`` en utilisant :command:`yum` :

source: Other distributions
fr: Autres distributions

source: Most Linux distributions have Sphinx in their package repositories. Usually the package is called ``python3-sphinx``, ``python-sphinx`` or ``sphinx``. Be aware that there are at least two other packages with ``sphinx`` in their name: a speech recognition toolkit (*CMU Sphinx*) and a full-text search database (*Sphinx search*).
fr: La plupart des distributions Linux ont Sphinx dans leurs dépôts de paquets. En général, le paquet s'appelle ``python3-sphinx``, ``python-sphinx`` ou ``sphinx``. Sachez qu'il y a au moins deux autres logiciels avec ``sphinx`` dans leur nom : une boîte à outil de reconnaissance vocale (*CMU Sphinx*) et un moteur de recherche plein texte (*Sphinx search*).

source: Sphinx can be installed using `Homebrew`__, `MacPorts`__, or as part of a Python distribution such as `Anaconda`__.
fr: Sphinx peut être installé avec `Homebrew`__, `MacPorts`__, ou comme élément d'une distribution Python telle qu'`Anaconda`__.

source: For more information, refer to the `package overview`__.
fr: Pour plus d'informations, référez-vous à l'`aperçu du paquet`__.

source: Install either ``python3x-sphinx`` using :command:`port`:
fr: Installez ``python3x-sphinx`` en utilisant la commande :command:`port` :

source: To set up the executable paths, use the ``port select`` command:
fr: Pour configurer les chemins des exécutables, utilisez la commande ``port select`` :

source: Sphinx can be install using `Chocolatey`__ or :ref:`installed manually <windows-other-method>`.
fr: Sphinx peut être installé en utilisant `Chocolatey`__ ou :ref:`manuellement <windows-other-method>`.

source: You would need to `install Chocolatey <https://chocolatey.org/install>`_ before running this.
fr: Il vous faut d'abord `installer Chocolatey <https://chocolatey.org/install>`_ pour utiliser cette méthode.

source: For more information, refer to the `chocolatey page`__.
fr: Pour plus d'informations, référez-vous à la `page Chocolatey`__.

source: Other Methods
fr: Autres méthodes

source: Most Windows users do not have Python installed by default, so we begin with the installation of Python itself. To check if you already have Python installed, open the *Command Prompt* (:kbd:`⊞Win-r` and type :command:`cmd`). Once the command prompt is open, type :command:`python --version` and press Enter. If Python is installed, you will see the version of Python printed to the screen. If you do not have Python installed, refer to the `Hitchhikers Guide to Python's`__ Python on Windows installation guides. You must install `Python 3`__.
fr: La plupart des utilisateurs de Windows n’ont pas Python installé par défaut, il faut donc commencer par l'installation de Python lui-même. Pour vérifier si vous disposez déjà de Python installé, ouvrez l'*Invite de commande* (:kbd:`⊞Win-r` et tapez :command:`cmd`). Une fois l'invite ouverte, tapez :command:`python --version` puis :kbd:`Entrée`. Si Python est installé, vous verrez la version installée de Python s'afficher à l'écran. Si Python n'est pas installé, référez-vous aux guides d'installation sous Windows du `Guide de l'auto-stoppeur Python`__. Vous devez installer `Python 3`__.

source: Once Python is installed, you can install Sphinx using :command:`pip`. Refer to the :ref:`pip installation instructions <install-pypi>` below for more information.
fr: Une fois Python installé, vous pouvez installer Sphinx en utilisant :command:`pip`. Référez-vous aux :ref:`instructions d'installation de pip<install-pypi>` ci-dessous pour plus d'informations.

source: Installation from PyPI
fr: Installation depuis PyPI

source: Sphinx packages are published on the `Python Package Index <https://pypi.org/project/Sphinx/>`_. The preferred tool for installing packages from *PyPI* is :command:`pip`. This tool is provided with all modern versions of Python.
fr: Les paquets Sphinx sont publiés dans l'`Index des Paquets Python (PyPI) <https://pypi.org/project/Sphinx/>`_. L'outil préféré pour l'installation de paquets depuis *PyPI* est :command:`pip`. Cet outil est fournit avec toutes les versions modernes de Python.

source: On Linux or MacOS, you should open your terminal and run the following command.
fr: Sous Linux et macOS, vous devriez ouvrir un *terminal* et exécuter la commande suivante :

source: On Windows, you should open *Command Prompt* (:kbd:`⊞Win-r` and type :command:`cmd`) and run the same command.
fr: Sous Windows, vous devriez ouvrir une *Invite de commande* (:kbd:`⊞Win-r` et tapez :command:`cmd`) et exécuter la commande :

source: After installation, type :command:`sphinx-build --version` on the command prompt. If everything worked fine, you will see the version number for the Sphinx package you just installed.
fr: Après installation, exécutez la commande :command:`sphinx-build --version` à l'invite de commande. Si tout a bien fonctionné, vous verrez le numéro de version du paquet Sphinx que vous venez d'installer.

source: Installation from *PyPI* also allows you to install the latest development release. You will not generally need (or want) to do this, but it can be useful if you see a possible bug in the latest stable release. To do this, use the ``--pre`` flag.
fr: L'installation depuis *PyPI* vous permet aussi d'installer la dernière version de développement. Vous n'aurez généralement pas besoin de (ni ne voudrez) le faire, mais cela peut s'avérer utile si vous rencontrez un possible bogue dans la dernière version stable. Pour ce faire, utilisez l'option ``--pre`` :

source: Using virtual environments
fr: Environnements virtuels

source: When installing Sphinx using pip, it is highly recommended to use *virtual environments*, which isolate the installed packages from the system packages, thus removing the need to use administrator privileges. To create a virtual environment in the ``.venv`` directory, use the following command.
fr: Lorsque vous installez Sphinx avec pip, il est fortement recommandé d'utiliser les *environnements virtuels* qui isolent les paquets installés des paquets système, supprimant ainsi le besoin d'utiliser des privilèges administrateur. Pour créer un environnement virtuel dans le répertoire ``.venv``, utilisez la commande suivante :

source: You can read more about them in the `Python Packaging User Guide`_.
fr: Vous pouvez en lire plus à leur sujet dans le `Guide d'Empaquetage Python`_.

source: Note that in some Linux distributions, such as Debian and Ubuntu, this might require an extra installation step as follows.
fr: Notez que sous certaines distributions Linux, telles que Debian et Ubuntu, ceci peut nécessiter une étape d'installation supplémentaire comme la suivante :

source: Docker images for Sphinx are published on the `Docker Hub`_. There are two kind of images:
fr: Des images Docker pour Sphinx sont publiées sur le `Hub Docker`_. Il y a deux types d'images :

source: Former one is used for standard usage of Sphinx, and latter one is mainly used for PDF builds using LaTeX. Please choose one for your purpose.
fr: La première est destinée à une utilisation standard de Sphinx, et la deuxième principalement à la génération de PDFs en utilisant LaTeX. Veuillez choisir celle correspondant à votre usage.

source: sphinxdoc/sphinx-latexpdf contains TeXLive packages. So the image is very large (over 2GB!).
fr: sphinxdoc/sphinx-latexpdf inclut le paquet TeXLive. De ce fait, l'image est très lourde (plus de 2 Go!).

source: When using docker images, please use ``docker run`` command to invoke sphinx commands. For example, you can use following command to create a Sphinx project:
fr: Lorsque vous utilisez des images Docker, veuillez utiliser la commande ``docker run`` pour invoquer Sphinx. Par exemple, vous pouvez utiliser la commande suivante pour créer un projet Sphinx :

source: And you can use the following command to build HTML document:
fr: Et vous pouvez utiliser la commande suivante pour générer des documents HTML :

source: For more details, please read `README file`__ of docker images.
fr: Pour plus de détails, veuillez lire le `fichier README`__ des images Docker.

source: Installation from source
fr: Installation depuis les sources

source: You can install Sphinx directly from a clone of the `Git repository`__. This can be done either by cloning the repo and installing from the local clone, on simply installing directly via :command:`git`.
fr: Vous pouvez installer Sphinx directement depuis un clone du `Dépôt Git`__. Ceci peut être fait soit en clonant le dépôt et en installant depuis le clone local, soit en installant directement avec :command:`git`.

source: You can also download a snapshot of the Git repo in either `tar.gz`__ or `zip`__ format. Once downloaded and extracted, these can be installed with :command:`pip` as above.
fr: Vous pouvez aussi télécharger un instantané du dépôt Git aux formats `tar.gz`__ ou `zip`__. Une fois téléchargé et extrait, ces sources peuvent être installées avec :command:`pip` comme ci-dessus.
