Repository: ekaterina-n/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/internals/contributing.po
Languages: pt_br

source: Contributing to Sphinx
pt_br: Contribuindo para o Sphinx

source: There are many ways you can contribute to Sphinx, be it filing bug reports or feature requests, writing new documentation or submitting patches for new or fixed behavior. This guide serves to illustrate how you can get started with this.
pt_br: Existem muitas maneiras de contribuir para o Sphinx, seja enviando relatórios de erros ou solicitações de recursos, escrevendo nova documentação ou enviando patches para comportamento novo ou corrigido. Este guia serve para ilustrar como você pode começar com isso.

source: Get help
pt_br: Obter ajuda

source: The Sphinx community maintains a number of mailing lists and IRC channels.
pt_br: A comunidade do Sphinx mantém uma série de listas de discussão e canais de IRC.

source: Stack Overflow with tag `python-sphinx`_
pt_br: Stack Overflow com a tag `python-sphinx`_

source: Questions and answers about use and development.
pt_br: Perguntas e respostas sobre o uso e o desenvolvimento.

source: Mailing list for user support.
pt_br: Lista de discussão para suporte a usuário(a).

source: Mailing list for development related discussions.
pt_br: Lista de discussão para discussões relacionadas a desenvolvimento.

source: #sphinx-doc on irc.libera.chat
pt_br: #sphinx-doc no irc.libera.chat

source: IRC channel for development questions and user support.
pt_br: Canal IRC para perguntas desenvolvimento e suporte a usuário(a).

source: Bug Reports and Feature Requests
pt_br: Relatórios de bugs e solicitação de recursos

source: If you have encountered a problem with Sphinx or have an idea for a new feature, please submit it to the `issue tracker`_ on GitHub or discuss it on the `sphinx-dev`_ mailing list.
pt_br: Se você encontrou um problema no Sphinx ou tem uma ideia para um novo recurso, envie-o para o `rastreador de problemas`_ no GitHub ou discuta-o na lista de discussão `sphinx-dev`_.

source: For bug reports, please include the output produced during the build process and also the log file Sphinx creates after it encounters an unhandled exception. The location of this file should be shown towards the end of the error message.
pt_br: Para relatórios de bugs, inclua a saída produzida durante o processo de construção e também o arquivo de log criado pelo Sphinx após encontrar uma exceção não tratada. O local deste arquivo deve ser mostrada no final da mensagem de erro.

source: Including or providing a link to the source files involved may help us fix the issue. If possible, try to create a minimal project that produces the error and post that instead.
pt_br: Incluindo or informando um link para os arquivos fonte envolvidos podem ajudar na correção da ocorrência. Se possível, tente criar e postar um projeto restrito para reproduzir e exibir o erro.

source: Contribute code
pt_br: Contribuir com código

source: The Sphinx source code is managed using Git and is hosted on `GitHub`__. The recommended way for new contributors to submit code to Sphinx is to fork this repository and submit a pull request after committing changes to their fork. The pull request will then need to be approved by one of the core developers before it is merged into the main repository.
pt_br: O código-fonte do Sphinx é gerenciado usando Git e está hospedado no `GitHub`__. A maneira recomendada para novos contribuidores enviarem código para o Sphinx é fazer o fork deste repositório e enviar uma pull request após fazer commit das alterações em seu fork. A pull request precisará então ser aprovada por um dos desenvolvedores principais antes de ser incorporada ao repositório principal.

source: Getting started
pt_br: Primeiros passos

source: Before starting on a patch, we recommend checking for open issues or open a fresh issue to start a discussion around a feature idea or a bug. If you feel uncomfortable or uncertain about an issue or your changes, feel free to email the *sphinx-dev* mailing list.
pt_br: Antes de iniciar um patch, recomendamos verificar se há problemas em aberto ou abrir um novo problema para iniciar uma discussão sobre uma ideia de recurso ou um bug. Se você se sentir desconfortável ou incerto sobre um problema ou suas alterações, sinta-se à vontade para enviar um e-mail para a lista de discussão *sphinx-dev*.

source: These are the basic steps needed to start developing on Sphinx.
pt_br: Passos básicos necessários para iniciar no desenvolvimento no Sphinx.

source: Create an account on GitHub.
pt_br: Crie uma conta no GitHub.

source: Fork the main Sphinx repository (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx>`_) using the GitHub interface.
pt_br: Faça um fork do repositório principal do Sphinx (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx>`_) usando a interface do GitHub.

source: Clone the forked repository to your machine. ::
pt_br: Clone o repositório fork para seu computador. ::

source: Checkout the appropriate branch.
pt_br: Faça o checkout para o branch apropriado.

source: Sphinx adopts Semantic Versioning 2.0.0 (refs: https://semver.org/ ).
pt_br: O Sphinx adota o *Versionamento Semântico 2.0.0* (refs: https://semver.org/lang/pt-BR/ ).

source: For changes that preserves backwards-compatibility of API and features, they should be included in the next MINOR release, use the ``A.x`` branch. ::
pt_br: Para alterações que preservam a compatibilidade retroativa da API e dos recursos, elas devem ser incluídas na próxima versão MENOR, use a ramificação ``A.x``::

source: For incompatible or other substantial changes that should wait until the next MAJOR release, use the ``master`` branch.
pt_br: Para alterações substanciais incompatíveis ou outras que devem aguardar até a próxima liberação MAIOR, use o branch ``master``.

source: For urgent release, a new PATCH branch must be branched from the newest release tag (see :doc:`release-process` for detail).
pt_br: Para um lançamento urgente, um novo branch PATCH deve ser ramificado a partir da tag de lançamento mais recente (veja :doc:`release-process` para detalhes).

source: Setup a virtual environment.
pt_br: Configure um ambiente virtual.

source: This is not necessary for unit testing, thanks to ``tox``, but it is necessary if you wish to run ``sphinx-build`` locally or run unit tests without the help of ``tox``::
pt_br: Isto não é necessário para testes unitários, graças ao ``tox``, mas é necessário se você deseja executar ``sphinx-build`` localmente ou executar testes unitários sem a ajuda do ``tox``::

source: Create a new working branch. Choose any name you like. ::
pt_br: Crie um novo ramo de trabalho. Escolha qualquer nome que desejar. ::

source: Hack, hack, hack.
pt_br: Hack, trabalhe, trabalhe, escreva.

source: Write your code along with tests that shows that the bug was fixed or that the feature works as expected.
pt_br: Escreva seu código junto com testes que mostram que o bug foi corrigido ou que o recurso funciona conforme o esperado.

source: Add a bullet point to :file:`CHANGES.rst` if the fix or feature is not trivial (small doc updates, typo fixes), then commit::
pt_br: Adicione um marcador a :file:`CHANGES.rst` se a correção ou recurso não for trivial (pequenas atualizações de documentos, correções de erros de digitação) e, em seguida, faça o commit::

source: GitHub recognizes certain phrases that can be used to automatically update the issue tracker. For example::
pt_br: O GitHub reconhece certas frases que podem ser usadas para atualizar automaticamente o rastreador de problemas. Por exemplo::

source: would close issue #42.
pt_br: fecharia o issue #42.

source: Push changes in the branch to your forked repository on GitHub::
pt_br: Faça push das alterações no branch para o seu fork do repositório no GitHub::

source: Submit a pull request from your branch to the respective branch (``master`` or ``A.x``).
pt_br: Submeta uma pull request do seu branch para o respectivo branch (``master`` ou ``A.x``).

source: Wait for a core developer to review your changes.
pt_br: Aguarde até que um core developer revise suas modificações.

source: Coding style
pt_br: Estilo de codificação

source: Please follow these guidelines when writing code for Sphinx:
pt_br: Siga estas diretrizes ao escrever código para o Sphinx:

source: Try to use the same code style as used in the rest of the project.
pt_br: Tente usar o mesmo estilo de código usado no restante do projeto.

source: For non-trivial changes, please update the :file:`CHANGES.rst` file. If your changes alter existing behavior, please document this.
pt_br: Para modificações não triviais, favor atualizar arquivo :file:`CHANGES.rst`. Caso suas atualizações modifiquem comportamentos, favor documentar isso.

source: New features should be documented. Include examples and use cases where appropriate. If possible, include a sample that is displayed in the generated output.
pt_br: Novas funcionalidades devem ser documentadas. Incluir exemplos e usos onde apropriado. Se possível, incluir um exemplo do que é exibido na geração de saída.

source: When adding a new configuration variable, be sure to document it and update :file:`sphinx/cmd/quickstart.py` if it's important enough.
pt_br: Ao adicionar uma nova variável de configuração, certifique-se de documentá-la e atualizar :file:`sphinx/cmd/quickstart.py` se ela for importante o suficiente.

source: Add appropriate unit tests.
pt_br: Adicione tests de unidade apropriados.

source: Style and type checks can be run as follows::
pt_br: As verificações de estilo e tipo podem ser executadas da seguinte forma:

source: Unit tests
pt_br: Testes de unidade

source: Sphinx is tested using `pytest`__ for Python code and `Karma`__ for JavaScript.
pt_br: Sphinx é testado usando `pytest`__ para código Python e `Karma`__ para JavaScript.

source: To run Python unit tests, we recommend using ``tox``, which provides a number of targets and allows testing against multiple different Python environments:
pt_br: Para executar testes de unidade Python, recomendamos usar ``tox``, que fornece vários alvos e permite testes em vários ambientes Python diferentes:

source: To list all possible targets::
pt_br: Para listar todos os alvos possíveis::

source: To run unit tests for a specific Python version, such as Python 3.10::
pt_br: Para executar testes de unidade para uma versão específica do Python, como Python 3.10::

source: To run unit tests for a specific Python version and turn on deprecation warnings so they're shown in the test output::
pt_br: Para executar testes de unidade para uma versão específica do Python e ativar avisos de descontinuação para que sejam mostrados na saída do teste:

source: Arguments to ``pytest`` can be passed via ``tox``, e.g., in order to run a particular test::
pt_br: Argumentos para ``pytest`` podem ser passados ​​via ``tox``, por exemplo, para executar um teste específico::

source: You can also test by installing dependencies in your local environment::
pt_br: Você também pode testar instalando dependências em seu ambiente local::

source: To run JavaScript tests, use ``npm``::
pt_br: Para executar testes de JavaScript, use ``npm``::

source: ``karma`` requires a Firefox binary to use as a test browser.
pt_br: ``karma`` requer um binário do Firefox para usar como navegador de teste.

source: For Unix-based systems, you can specify the path to the Firefox binary using::
pt_br: Para sistemas baseados em Unix, você pode especificar o caminho para o binário do Firefox usando::

source: New unit tests should be included in the ``tests`` directory where necessary:
pt_br: Novos testes de unidade devem ser incluídos no diretório ``tests`` onde necessário:

source: For bug fixes, first add a test that fails without your changes and passes after they are applied.
pt_br: Para corrigir bugs, primeiro adicionar um teste que falha seu suas modificações e passe após suas modificações.

source: Tests that need a ``sphinx-build`` run should be integrated in one of the existing test modules if possible. New tests that to ``@with_app`` and then ``build_all`` for a few assertions are not good since *the test suite should not take more than a minute to run*.
pt_br: Os testes que precisam de uma execução do ``sphinx-build`` devem ser integrados em um dos módulos de teste existentes, se possível. Novos testes que para ``@with_app`` e depois ``build_all`` para algumas asserções não são bons desde *o conjunto de testes não demore mais de um minuto para ser executado*.

source: Sphinx also runs JavaScript tests.
pt_br: O Sphinx também executa testes de JavaScript.

source: ``sphinx.testing`` is added as a experimental.
pt_br: ``sphinx.testing`` é adicionado como experimental.

source: Sphinx was switched from nose to pytest.
pt_br: O Sphinx trocou de nose para pytest.

source: Todo
pt_br: Por fazer

source: The below belongs in the developer guide
pt_br: O texto abaixo pertence ao guia do desenvolvedor

source: Utility functions and pytest fixtures for testing are provided in ``sphinx.testing``. If you are a developer of Sphinx extensions, you can write unit tests by using pytest. At this time, ``sphinx.testing`` will help your test implementation.
pt_br: Funções de utilidade e os fixtures do pytest para testes são fornecidos em ``sphinx.testing``. Se você é um desenvolvedor de extensões Sphinx, você pode escrever testes de unidade usando o pytest. Neste momento, o ``sphinx.testing`` ajudará sua implementação de teste.

source: How to use pytest fixtures that are provided by ``sphinx.testing``? You can require ``'sphinx.testing.fixtures'`` in your test modules or ``conftest.py`` files like this::
pt_br: Como usar as fixtures do pytest que são fornecidos pelo ``sphinx.testing``? Você pode exigir ``'sphinx.testing.fixtures'`` em seus módulos de teste ou em arquivos ``conftest.py`` como este::

source: If you want to know more detailed usage, please refer to ``tests/conftest.py`` and other ``test_*.py`` files under the ``tests`` directory.
pt_br: Se você quiser saber o uso mais detalhado, consulte ``tests/conftest.py`` e outros arquivos ``test_*.py`` sob o diretório ``tests``.

source: Contribute documentation
pt_br: Contribuir com documentação

source: Contributing to documentation involves modifying the source files found in the ``doc/`` folder. To get started, you should first follow :ref:`contribute-get-started`, and then take the steps below to work with the documentation.
pt_br: Contribuir para a documentação envolve modificar os arquivos fonte encontrados na pasta ``doc/``. Para começar, você deve primeiro seguir :ref:`contribute-get-started` e depois seguir os passos abaixo para trabalhar com a documentação.

source: The following sections describe how to get started with contributing documentation, as well as key aspects of a few different tools that we use.
pt_br: As seções a seguir descrevem como começar a contribuir com documentação, bem como os principais aspectos de algumas ferramentas diferentes que usamos.

source: Add a more extensive documentation contribution guide.
pt_br: Adicionar um guia de contribuição de documentação mais extenso.

source: Build the documentation
pt_br: Construir a documentação

source: To build the documentation, run the following command::
pt_br: Para construir a documentação, execute o seguinte comando::

source: This will parse the Sphinx documentation's source files and generate HTML for you to preview in ``build/sphinx/html``.
pt_br: Isto irá analisar os arquivos fonte da documentação do Sphinx e gerar HTML para você visualizar em ``build/sphinx/html``.

source: You can also build a **live version of the documentation** that you can preview in the browser. It will detect changes and reload the page any time you make edits. To do so, run the following command::
pt_br: Você também pode construir uma **versão live da documentação** que pode ser visualizada no navegador. Ele detectará alterações e recarregará a página sempre que você fizer edições. Para fazer isso, execute o seguinte comando::

source: Translations
pt_br: Traduções

source: The parts of messages in Sphinx that go into builds are translated into several locales. The translations are kept as gettext ``.po`` files translated from the master template :file:`sphinx/locale/sphinx.pot`.
pt_br: As partes das mensagens no Sphinx que vão para as construções são traduzidas em várias localidades. As traduções são mantidas como arquivos gettext ``.po`` traduzidos do modelo mestre :file:`sphinx/locale/sphinx.pot`.

source: Sphinx uses `Babel <https://babel.pocoo.org/en/latest/>`_ to extract messages and maintain the catalog files. The ``utils`` directory contains a helper script, ``babel_runner.py``.
pt_br: Sphinx usa `Babel <https://babel.pocoo.org/en/latest/>`_ para extrair mensagens e manter os arquivos do catálogo. O diretório ``utils`` contém um script auxiliar, ``babel_runner.py``.

source: Use ``python babel_runner.py extract`` to update the ``.pot`` template.
pt_br: Use ``python babel_runner.py extract`` para atualizar modelo ``.pot``.

source: Use ``python babel_runner.py update`` to update all existing language catalogs in ``sphinx/locale/*/LC_MESSAGES`` with the current messages in the template file.
pt_br: Use ``python babel_runner.py update`` para atualizar todos os catálogos de idiomas em ``sphinx/locale/*/LC_MESSAGES`` com mensagens do arquivo modelo.

source: Use ``python babel_runner.py compile`` to compile the ``.po`` files to binary ``.mo`` files and ``.js`` files.
pt_br: Use ``python babel_runner.py compile`` para compilar os arquivos ``.po`` em arquivos binários ``.mo`` e arquivos ``.js``.

source: When an updated ``.po`` file is submitted, run ``python babel_runner.py compile`` to commit both the source and the compiled catalogs.
pt_br: Quando arquivo ``.po`` for submetido, executar ``python babel_runner.py compile`` para o fazer commit de ambos catálogos fonte e compilados.

source: When a new locale is submitted, add a new directory with the ISO 639-1 language identifier and put ``sphinx.po`` in there. Don't forget to update the possible values for :confval:`language` in ``doc/usage/configuration.rst``.
pt_br: Quando uma nova localidade é enviada, adicione um novo diretório com o identificador de idioma ISO 639-1 e coloque ``sphinx.po`` nele. Não se esqueça de atualizar os valores possíveis para :confval:`language` em ``doc/usage/configuration.rst``.

source: The Sphinx core messages can also be translated on `Transifex <https://www.transifex.com/sphinx-doc/sphinx-1/>`_. There ``tx`` client tool, which is provided by the ``transifex_client`` Python package, can be used to pull translations in ``.po`` format from Transifex. To do this, go to ``sphinx/locale`` and then run ``tx pull -f -l LANG`` where ``LANG`` is an existing language identifier. It is good practice to run ``python babel_runner.py update`` afterwards to make sure the ``.po`` file has the canonical Babel formatting.
pt_br: As mensagens principais do Sphinx também podem ser traduzidas no `Transifex <https://www.transifex.com/sphinx-doc/sphinx-1/>`_. A ferramenta cliente ``tx``, que é fornecida pelo pacote Python ``transifex_client``, pode ser usada para extrair traduções no formato ``.po`` do Transifex. Para fazer isso, vá para ``sphinx/locale`` e então execute ``tx pull -f -l LANG`` onde ``LANG`` é um identificador de idioma existente. É uma boa prática executar ``python babel_runner.py update`` posteriormente para garantir que o arquivo ``.po`` tenha a formatação canônica do Babel.

source: Debugging tips
pt_br: Dicas de depuração

source: Delete the build cache before building documents if you make changes in the code by running the command ``make clean`` or using the :option:`sphinx-build -E` option.
pt_br: Apague o cache de construção antes de construir documentos, caso tenha feito modificações no código, usar o comando ``make clean`` ou usar a opção :option:`sphinx-build -E`.

source: Use the :option:`sphinx-build -P` option to run ``pdb`` on exceptions.
pt_br: Use a opção :option:`sphinx-build -P` para executar ``pd`` em exceções.

source: Use ``node.pformat()`` and ``node.asdom().toxml()`` to generate a printable representation of the document structure.
pt_br: Use ``node.pformat()`` e ``node.asdom().toxml()`` para gerar representação impressa da estrutura do documento.

source: Set the configuration variable :confval:`keep_warnings` to ``True`` so warnings will be displayed in the generated output.
pt_br: Defina a variável de configuração :confval:`keep_warnings` para ``True`` assim os avisos serão exibidos na saída gerada.

source: Set the configuration variable :confval:`nitpicky` to ``True`` so that Sphinx will complain about references without a known target.
pt_br: Configure a variável :confval:`nitpicky` para ``True`` assim Sphinx irá respeitar referências sem alvos conhecidos.

source: Set the debugging options in the `Docutils configuration file <https://docutils.sourceforge.io/docs/user/config.html>`_.
pt_br: Define as opções de depuração no `arquivo de configuração do Docutils <https://docutils.sourceforge.io/docs/user/config.html>`_.

source: JavaScript stemming algorithms in ``sphinx/search/non-minified-js/*.js`` are generated using `snowball <https://github.com/snowballstem/snowball>`_ by cloning the repository, executing ``make dist_libstemmer_js`` and then unpacking the tarball which is generated in ``dist`` directory.
pt_br: Algoritmos de stemming JavaScript em ``sphinx/search/non-minified-js/*.js`` são gerados usando ``snowball <https://github.com/snowballstem/snowball>`_ clonando o repositório, executando ``make dist_libstemmer_js`` e então descompactando o tarball que é gerado no diretório ``dist``.

source: Minified files in ``sphinx/search/minified-js/*.js`` are generated from non-minified ones using ``uglifyjs`` (installed via npm), with ``-m`` option to enable mangling.
pt_br: Arquivos minificados em ``sphinx/search/minified-js/*.js`` são gerados a partir de arquivos não minificados usando ``uglifyjs`` (instalado via npm), com a opção ``-m`` para habilitar a manipulação.
